Repository: python/python-docs-it
Catalog: whatsnew/3.12.po
Languages: it_it

source: Add two new public functions, :c:func:`PyEval_SetProfileAllThreads` and :c:func:`PyEval_SetTraceAllThreads`, that allow to set tracing and profiling functions in all running threads in addition to the calling one. (Contributed by Pablo Galindo in :gh:`93503`.)
it_it: Aggiunte due nuove funzioni pubbliche, :c:func:`PyEval_SetProfileAllThreads` e :c:func:`PyEval_SetTraceAllThreads`, che permettono di impostare funzioni di tracciamento e profilazione in tutti i thread in esecuzione oltre a quello chiamante. (Contributo di Pablo Galindo in :gh:`93503`.)

source: Add new function :c:func:`PyFunction_SetVectorcall` to the C API which sets the vectorcall field of a given :c:type:`PyFunctionObject`. (Contributed by Andrew Frost in :gh:`92257`.)
it_it: Aggiunta la nuova funzione :c:func:`PyFunction_SetVectorcall` alla C API che imposta il campo vectorcall di un dato :c:type:`PyFunctionObject`. (Contributo di Andrew Frost in :gh:`92257`.)

source: The C API now permits registering callbacks via :c:func:`PyDict_AddWatcher`, :c:func:`PyDict_Watch` and related APIs to be called whenever a dictionary is modified. This is intended for use by optimizing interpreters, JIT compilers, or debuggers. (Contributed by Carl Meyer in :gh:`91052`.)
it_it: La C API ora consente di registrare callback tramite :c:func:`PyDict_AddWatcher`, :c:func:`PyDict_Watch` e API correlate che vengono chiamate ogni volta che un dizionario viene modificato. Questo è inteso per l'uso da parte di interpreti ottimizzanti, compilatori JIT o debugger. (Contributo di Carl Meyer in :gh:`91052`.)

source: Add :c:func:`PyType_AddWatcher` and :c:func:`PyType_Watch` API to register callbacks to receive notification on changes to a type. (Contributed by Carl Meyer in :gh:`91051`.)
it_it: Aggiunte le API :c:func:`PyType_AddWatcher` e :c:func:`PyType_Watch` per registrare callback che ricevono notifiche sulle modifiche a un tipo. (Contributo di Carl Meyer in :gh:`91051`.)

source: Add :c:func:`PyCode_AddWatcher` and :c:func:`PyCode_ClearWatcher` APIs to register callbacks to receive notification on creation and destruction of code objects. (Contributed by Itamar Oren in :gh:`91054`.)
it_it: Aggiunte le API :c:func:`PyCode_AddWatcher` e :c:func:`PyCode_ClearWatcher` per registrare callback che ricevono notifiche sulla creazione e distruzione di oggetti di codice. (Contributo di Itamar Oren in :gh:`91054`.)

source: Add :c:func:`PyFrame_GetVar` and :c:func:`PyFrame_GetVarString` functions to get a frame variable by its name. (Contributed by Victor Stinner in :gh:`91248`.)
it_it: Aggiunte le funzioni :c:func:`PyFrame_GetVar` e :c:func:`PyFrame_GetVarString` per ottenere una variabile di frame per nome. (Contributo di Victor Stinner in :gh:`91248`.)

source: Add :c:func:`PyErr_GetRaisedException` and :c:func:`PyErr_SetRaisedException` for saving and restoring the current exception. These functions return and accept a single exception object, rather than the triple arguments of the now-deprecated :c:func:`PyErr_Fetch` and :c:func:`PyErr_Restore`. This is less error prone and a bit more efficient. (Contributed by Mark Shannon in :gh:`101578`.)
it_it: Aggiunte :c:func:`PyErr_GetRaisedException` e :c:func:`PyErr_SetRaisedException` per salvare e ripristinare l'eccezione corrente. Queste funzioni restituiscono e accettano un singolo oggetto eccezione, anziché i tre argomenti della ormai deprecata :c:func:`PyErr_Fetch` e :c:func:`PyErr_Restore`. Questo è meno soggetto a errori e un po' più efficiente. (Contributo di Mark Shannon in :gh:`101578`.)

source: Add ``_PyErr_ChainExceptions1``, which takes an exception instance, to replace the legacy-API ``_PyErr_ChainExceptions``, which is now deprecated. (Contributed by Mark Shannon in :gh:`101578`.)
it_it: Aggiunto ``_PyErr_ChainExceptions1``, che accetta un'istanza di eccezione, per sostituire l'API legacy ``_PyErr_ChainExceptions``, che ora è deprecata. (Contributo di Mark Shannon in :gh:`101578`.)

source: Add :c:func:`PyException_GetArgs` and :c:func:`PyException_SetArgs` as convenience functions for retrieving and modifying the :attr:`~BaseException.args` passed to the exception's constructor. (Contributed by Mark Shannon in :gh:`101578`.)
it_it: Aggiunte :c:func:`PyException_GetArgs` e :c:func:`PyException_SetArgs` come funzioni di comodo per recuperare e modificare gli :attr:`~BaseException.args` passati al costruttore dell'eccezione. (Contributo di Mark Shannon in :gh:`101578`.)

source: Add :c:func:`PyErr_DisplayException`, which takes an exception instance, to replace the legacy-api :c:func:`!PyErr_Display`. (Contributed by Irit Katriel in :gh:`102755`).
it_it: Aggiunta :c:func:`PyErr_DisplayException`, che accetta un'istanza di eccezione, per sostituire l'API legacy :c:func:`!PyErr_Display`. (Contributo di Irit Katriel in :gh:`102755`).

source: :pep:`683`: Introduce *Immortal Objects*, which allows objects to bypass reference counts, and related changes to the C-API:
it_it: :pep:`683`: Introdurre *Immortal Objects*, che consente agli oggetti di bypassare i conti di riferimento, e modifiche correlate alla C-API:

source: ``_Py_IMMORTAL_REFCNT``: The reference count that defines an object
it_it: ``_Py_IMMORTAL_REFCNT``: Il conteggio dei riferimenti che definisce un oggetto

source: as immortal.
it_it: come immortale.

source: ``_Py_IsImmortal`` Checks if an object has the immortal reference count.
it_it: ``_Py_IsImmortal`` Controlla se un oggetto ha il conteggio dei riferimenti immortali.

source: ``PyObject_HEAD_INIT`` This will now initialize reference count to
it_it: ``PyObject_HEAD_INIT`` Ora inizializzerà il conteggio dei riferimenti a

source: ``_Py_IMMORTAL_REFCNT`` when used with ``Py_BUILD_CORE``.
it_it: ``_Py_IMMORTAL_REFCNT`` quando usato con ``Py_BUILD_CORE``.

source: ``SSTATE_INTERNED_IMMORTAL`` An identifier for interned unicode objects
it_it: ``SSTATE_INTERNED_IMMORTAL`` Un identificatore per oggetti Unicode internati

source: that are immortal.
it_it: che sono immortali.

source: ``SSTATE_INTERNED_IMMORTAL_STATIC`` An identifier for interned unicode
it_it: ``SSTATE_INTERNED_IMMORTAL_STATIC`` Un identificatore per oggetti Unicode internati

source: objects that are immortal and static
it_it: che sono immortali e statici.

source: ``sys.getunicodeinternedsize`` This returns the total number of unicode
it_it: ``sys.getunicodeinternedsize`` Restituisce il numero totale di oggetti Unicode

source: objects that have been interned. This is now needed for :file:`refleak.py` to correctly track reference counts and allocated blocks
it_it: che sono stati internati. Questo è ora necessario per :file:`refleak.py` per monitorare correttamente i conti di riferimenti e i blocchi allocati.

source: (Contributed by Eddie Elizondo in :gh:`84436`.)
it_it: (Contributo di Eddie Elizondo in :gh:`84436`.)

source: :pep:`684`: Add the new :c:func:`Py_NewInterpreterFromConfig` function and :c:type:`PyInterpreterConfig`, which may be used to create sub-interpreters with their own GILs. (See :ref:`whatsnew312-pep684` for more info.) (Contributed by Eric Snow in :gh:`104110`.)
it_it: :pep:`684`: Aggiunta la nuova funzione :c:func:`Py_NewInterpreterFromConfig` e :c:type:`PyInterpreterConfig`, che possono essere utilizzate per creare sotto-interpreti con i propri GIL. (Vedi :ref:`whatsnew312-pep684` per maggiori informazioni.) (Contributo di Eric Snow in :gh:`104110`.)

source: In the limited C API version 3.12, :c:func:`Py_INCREF` and :c:func:`Py_DECREF` functions are now implemented as opaque function calls to hide implementation details. (Contributed by Victor Stinner in :gh:`105387`.)
it_it: Nella versione 3.12 della limited C API, le funzioni :c:func:`Py_INCREF` e :c:func:`Py_DECREF` sono ora implementate come chiamate di funzione opache per nascondere i dettagli dell'implementazione. (Contributo di Victor Stinner in :gh:`105387`.)

source: Legacy Unicode APIs based on ``Py_UNICODE*`` representation has been removed. Please migrate to APIs based on UTF-8 or ``wchar_t*``.
it_it: Le API Unicode legacy basate sulla rappresentazione ``Py_UNICODE*`` sono state rimosse. Si prega di migrare alle API basate su UTF-8 o ``wchar_t*``.

source: Argument parsing functions like :c:func:`PyArg_ParseTuple` doesn't support ``Py_UNICODE*`` based format (e.g. ``u``, ``Z``) anymore. Please migrate to other formats for Unicode like ``s``, ``z``, ``es``, and ``U``.
it_it: Le funzioni di analisi degli argomenti come :c:func:`PyArg_ParseTuple` non supportano più i formati basati su ``Py_UNICODE*`` (ad esempio ``u``, ``Z``). Si prega di migrare ad altri formati per Unicode come ``s``, ``z``, ``es`` e ``U``.

source: ``tp_weaklist`` for all static builtin types is always ``NULL``. This is an internal-only field on ``PyTypeObject`` but we're pointing out the change in case someone happens to be accessing the field directly anyway. To avoid breakage, consider using the existing public C-API instead, or, if necessary, the (internal-only) ``_PyObject_GET_WEAKREFS_LISTPTR()`` macro.
it_it: ``tp_weaklist`` per tutti i tipi built-in statici è sempre ``NULL``. Questo è un campo solo interno su ``PyTypeObject``, ma segnaliamo la modifica nel caso qualcuno lo stia accedendo direttamente. Per evitare interruzioni, si consiglia di utilizzare invece la C-API pubblica esistente o, se necessario, la macro (solo interna) ``_PyObject_GET_WEAKREFS_LISTPTR()``.

source: This internal-only :c:member:`PyTypeObject.tp_subclasses` may now not be a valid object pointer. Its type was changed to :c:expr:`void *` to reflect this. We mention this in case someone happens to be accessing the internal-only field directly.
it_it: Questo campo solo interno :c:member:`PyTypeObject.tp_subclasses` potrebbe ora non essere un puntatore a oggetto valido. Il suo tipo è stato cambiato in :c:expr:`void *` per riflettere questo. Menzioniamo questa modifica nel caso qualcuno stia accedendo direttamente al campo solo interno.

source: To get a list of subclasses, call the Python method :py:meth:`~class.__subclasses__` (using :c:func:`PyObject_CallMethod`, for example).
it_it: Per ottenere un elenco di sottoclassi, chiamare il metodo Python :py:meth:`~class.__subclasses__` (utilizzando ad esempio :c:func:`PyObject_CallMethod`).

source: Add support of more formatting options (left aligning, octals, uppercase hexadecimals, :c:type:`intmax_t`, :c:type:`ptrdiff_t`, :c:type:`wchar_t` C strings, variable width and precision) in :c:func:`PyUnicode_FromFormat` and :c:func:`PyUnicode_FromFormatV`. (Contributed by Serhiy Storchaka in :gh:`98836`.)
it_it: Aggiunto supporto per più opzioni di formattazione (allineamento a sinistra, ottali, esadecimali maiuscoli, :c:type:`intmax_t`, :c:type:`ptrdiff_t`, stringhe C :c:type:`wchar_t`, larghezza e precisione variabili) in :c:func:`PyUnicode_FromFormat` e :c:func:`PyUnicode_FromFormatV`. (Contributo di Serhiy Storchaka in :gh:`98836`.)

source: An unrecognized format character in :c:func:`PyUnicode_FromFormat` and :c:func:`PyUnicode_FromFormatV` now sets a :exc:`SystemError`. In previous versions it caused all the rest of the format string to be copied as-is to the result string, and any extra arguments discarded. (Contributed by Serhiy Storchaka in :gh:`95781`.)
it_it: Un carattere di formato non riconosciuto in :c:func:`PyUnicode_FromFormat` e :c:func:`PyUnicode_FromFormatV` ora imposta una :exc:`SystemError`. Nelle versioni precedenti, causava la copia invariata del resto della stringa di formato nella stringa di risultato e scartava eventuali argomenti extra. (Contributo di Serhiy Storchaka in :gh:`95781`.)

source: Fix wrong sign placement in :c:func:`PyUnicode_FromFormat` and :c:func:`PyUnicode_FromFormatV`. (Contributed by Philip Georgi in :gh:`95504`.)
it_it: Corretta la posizione errata del segno in :c:func:`PyUnicode_FromFormat` e :c:func:`PyUnicode_FromFormatV`. (Contributo di Philip Georgi in :gh:`95504`.)

source: Extension classes wanting to add a ``__dict__`` or weak reference slot should use :c:macro:`Py_TPFLAGS_MANAGED_DICT` and :c:macro:`Py_TPFLAGS_MANAGED_WEAKREF` instead of ``tp_dictoffset`` and ``tp_weaklistoffset``, respectively. The use of ``tp_dictoffset`` and ``tp_weaklistoffset`` is still supported, but does not fully support multiple inheritance (:gh:`95589`), and performance may be worse. Classes declaring :c:macro:`Py_TPFLAGS_MANAGED_DICT` should call :c:func:`!_PyObject_VisitManagedDict` and :c:func:`!_PyObject_ClearManagedDict` to traverse and clear their instance's dictionaries. To clear weakrefs, call :c:func:`PyObject_ClearWeakRefs`, as before.
it_it: Le classi estese che desiderano aggiungere uno slot ``__dict__`` o di riferimenti deboli dovrebbero usare :c:macro:`Py_TPFLAGS_MANAGED_DICT` e :c:macro:`Py_TPFLAGS_MANAGED_WEAKREF` anziché ``tp_dictoffset`` e ``tp_weaklistoffset``, rispettivamente. L'uso di ``tp_dictoffset`` e ``tp_weaklistoffset`` è ancora supportato, ma non supporta completamente l'ereditarietà multipla (:gh:`95589`), e le prestazioni potrebbero essere peggiori. Le classi che dichiarano :c:macro:`Py_TPFLAGS_MANAGED_DICT` dovrebbero chiamare :c:func:`!_PyObject_VisitManagedDict` e :c:func:`!_PyObject_ClearManagedDict` per attraversare e cancellare i dizionari delle loro istanze. Per cancellare i weakref, chiamare come prima :c:func:`PyObject_ClearWeakRefs`.

source: The :c:func:`PyUnicode_FSDecoder` function no longer accepts bytes-like paths, like :class:`bytearray` and :class:`memoryview` types: only the exact :class:`bytes` type is accepted for bytes strings. (Contributed by Victor Stinner in :gh:`98393`.)
it_it: La funzione :c:func:`PyUnicode_FSDecoder` non accetta più percorsi simili a byte, come :class:`bytearray` e tipi :class:`memoryview`: solo il tipo esatto :class:`bytes` è accettato per le stringhe di byte. (Contributo di Victor Stinner in :gh:`98393`.)

source: The :c:macro:`Py_CLEAR`, :c:macro:`Py_SETREF` and :c:macro:`Py_XSETREF` macros now only evaluate their arguments once. If an argument has side effects, these side effects are no longer duplicated. (Contributed by Victor Stinner in :gh:`98724`.)
it_it: Le macro :c:macro:`Py_CLEAR`, :c:macro:`Py_SETREF` e :c:macro:`Py_XSETREF` ora valutano i loro argomenti solo una volta. Se un argomento ha effetti collaterali, questi effetti collaterali non vengono più duplicati. (Contributo di Victor Stinner in :gh:`98724`.)

source: The interpreter's error indicator is now always normalized. This means that :c:func:`PyErr_SetObject`, :c:func:`PyErr_SetString` and the other functions that set the error indicator now normalize the exception before storing it. (Contributed by Mark Shannon in :gh:`101578`.)
it_it: L'indicatore di errore dell'interprete è ora sempre normalizzato. Questo significa che :c:func:`PyErr_SetObject`, :c:func:`PyErr_SetString` e le altre funzioni che impostano l'indicatore di errore ora normalizzano l'eccezione prima di memorizzarla. (Contributo di Mark Shannon in :gh:`101578`.)

source: ``_Py_RefTotal`` is no longer authoritative and only kept around for ABI compatibility. Note that it is an internal global and only available on debug builds. If you happen to be using it then you'll need to start using ``_Py_GetGlobalRefTotal()``.
it_it: ``_Py_RefTotal`` non è più autorevole e viene mantenuto solo per la compatibilità ABI. Nota che è una globale interna e disponibile solo build di debug. Se stai usando questa variabile, dovrai iniziare a usare ``_Py_GetGlobalRefTotal()``.

source: The following functions now select an appropriate metaclass for the newly created type:
it_it: Le seguenti funzioni ora selezionano una metaclasse appropriata per il tipo appena creato:

source: Creating classes whose metaclass overrides :c:member:`~PyTypeObject.tp_new` is deprecated, and in Python 3.14+ it will be disallowed. Note that these functions ignore ``tp_new`` of the metaclass, possibly allowing incomplete initialization.
it_it: Creare classi la cui metaclasse sovrascrive :c:member:`~PyTypeObject.tp_new` è deprecato e in Python 3.14+ sarà disabilitato. Nota che queste funzioni ignorano ``tp_new`` della metaclasse, possibilmente permettendo un'inizializzazione incompleta.

source: Note that :c:func:`PyType_FromMetaclass` (added in Python 3.12) already disallows creating classes whose metaclass overrides ``tp_new`` (:meth:`~object.__new__` in Python).
it_it: Nota che :c:func:`PyType_FromMetaclass` (aggiunto in Python 3.12) già impedisce la creazione di classi la cui metaclasse sovrascrive ``tp_new`` (:meth:`~object.__new__` in Python).

source: Since ``tp_new`` overrides almost everything ``PyType_From*`` functions do, the two are incompatible with each other. The existing behavior -- ignoring the metaclass for several steps of type creation -- is unsafe in general, since (meta)classes assume that ``tp_new`` was called. There is no simple general workaround. One of the following may work for you:
it_it: Poiché ``tp_new`` sovrascrive quasi tutto ciò che fanno le funzioni ``PyType_From*``, i due sono incompatibili tra loro. Il comportamento esistente — ignorare la metaclasse per diversi passaggi della creazione del tipo — è generalmente insicuro, poiché (meta)classi assumono che ``tp_new`` sia stato chiamato. Non esiste una soluzione generale semplice. Una delle seguenti opzioni potrebbe funzionare per te:

source: If you control the metaclass, avoid using ``tp_new`` in it:
it_it: Se controlli la metaclasse, evita di usare ``tp_new`` in essa:

source: If initialization can be skipped, it can be done in :c:member:`~PyTypeObject.tp_init` instead.
it_it: Se l'inizializzazione può essere saltata, può essere fatta al contrario in :c:member:`~PyTypeObject.tp_init`.

source: If the metaclass doesn't need to be instantiated from Python, set its ``tp_new`` to ``NULL`` using the :c:macro:`Py_TPFLAGS_DISALLOW_INSTANTIATION` flag. This makes it acceptable for ``PyType_From*`` functions.
it_it: Se la metaclasse non ha bisogno di essere istanziata da Python, imposta il suo ``tp_new`` su ``NULL`` utilizzando il flag :c:macro:`Py_TPFLAGS_DISALLOW_INSTANTIATION`. Ciò la rende accettabile per le funzioni ``PyType_From*``.

source: Avoid ``PyType_From*`` functions: if you don't need C-specific features (slots or setting the instance size), create types by :ref:`calling <call>` the metaclass.
it_it: Evita le funzioni ``PyType_From*``: se non ti servono funzionalità specifiche di C (slot o impostazione della dimensione dell'istanza), crea tipi tramite la :ref:`chiamata <call>` della metaclasse.

source: If you *know* the ``tp_new`` can be skipped safely, filter the deprecation warning out using :func:`warnings.catch_warnings` from Python.
it_it: Se *sai* che ``tp_new`` può essere saltato in sicurezza, filtra l'avviso di deprecazione usando :func:`warnings.catch_warnings` da Python.

source: :c:var:`PyOS_InputHook` and :c:var:`PyOS_ReadlineFunctionPointer` are no longer called in :ref:`subinterpreters <sub-interpreter-support>`. This is because clients generally rely on process-wide global state (since these callbacks have no way of recovering extension module state).
it_it: :c:var:`PyOS_InputHook` e :c:var:`PyOS_ReadlineFunctionPointer` non vengono più chiamati in :ref:`subinterpreters <sub-interpreter-support>`. Questo perché i client generalmente si affidano allo stato globale del processo (poiché questi callback non hanno modo di recuperare lo stato del modulo di estensione).

source: This also avoids situations where extensions may find themselves running in a subinterpreter that they don't support (or haven't yet been loaded in). See :gh:`104668` for more info.
it_it: Questo evita anche situazioni in cui le estensioni potrebbero trovarsi in esecuzione in un subinterprete che non supportano (o non sono ancora state caricate in). Vedi :gh:`104668` per ulteriori informazioni.

source: :c:struct:`PyLongObject` has had its internals changed for better performance. Although the internals of :c:struct:`PyLongObject` are private, they are used by some extension modules. The internal fields should no longer be accessed directly, instead the API functions beginning ``PyLong_...`` should be used instead. Two new *unstable* API functions are provided for efficient access to the value of :c:struct:`PyLongObject`\s which fit into a single machine word:
it_it: :c:struct:`PyLongObject` ha avuto i suoi interni cambiati per migliorare le prestazioni. Sebbene gli interni di :c:struct:`PyLongObject` siano privati, vengono utilizzati da alcuni moduli di estensione. I campi interni non devono più essere acceduti direttamente, ma devono essere utilizzate le funzioni API che iniziano con ``PyLong_...``. Vengono fornite due nuove funzioni API *instabili* per un accesso efficiente al valore dei :c:struct:`PyLongObject`\s che rientrano in una sola parola macchina:

source: Custom allocators, set via :c:func:`PyMem_SetAllocator`, are now required to be thread-safe, regardless of memory domain. Allocators that don't have their own state, including "hooks", are not affected. If your custom allocator is not already thread-safe and you need guidance then please create a new GitHub issue and CC ``@ericsnowcurrently``.
it_it: Gli allocatori personalizzati, impostati tramite :c:func:`PyMem_SetAllocator`, sono ora richiesti per essere thread-safe, indipendentemente dal dominio di memoria. Gli allocatori che non hanno uno stato proprio, compresi i "ganci", non sono interessati. Se il tuo allocatore personalizzato non è già thread-safe e hai bisogno di assistenza, crea un nuovo problema su GitHub e CC ``@ericsnowcurrently``.

source: In accordance with :pep:`699`, the ``ma_version_tag`` field in :c:type:`PyDictObject` is deprecated for extension modules. Accessing this field will generate a compiler warning at compile time. This field will be removed in Python 3.14. (Contributed by Ramvikrams and Kumar Aditya in :gh:`101193`. PEP by Ken Jin.)
it_it: In conformità con :pep:`699`, il campo ``ma_version_tag`` in :c:type:`PyDictObject` è deprecato per i moduli di estensione. L'accesso a questo campo genererà un avviso del compilatore al momento della compilazione. Questo campo sarà rimosso in Python 3.14. (Contribuito da Ramvikrams e Kumar Aditya in :gh:`101193`. PEP di Ken Jin.)

source: Deprecate global configuration variable:
it_it: Deprecare la variabile di configurazione globale:

source: :c:var:`Py_DebugFlag`: use :c:member:`PyConfig.parser_debug`
it_it: :c:var:`Py_DebugFlag`: usa :c:member:`PyConfig.parser_debug`

source: :c:var:`Py_VerboseFlag`: use :c:member:`PyConfig.verbose`
it_it: :c:var:`Py_VerboseFlag`: usa :c:member:`PyConfig.verbose`

source: :c:var:`Py_QuietFlag`: use :c:member:`PyConfig.quiet`
it_it: :c:var:`Py_QuietFlag`: usa :c:member:`PyConfig.quiet`

source: :c:var:`Py_InteractiveFlag`: use :c:member:`PyConfig.interactive`
it_it: :c:var:`Py_InteractiveFlag`: usa :c:member:`PyConfig.interactive`

source: :c:var:`Py_InspectFlag`: use :c:member:`PyConfig.inspect`
it_it: :c:var:`Py_InspectFlag`: usa :c:member:`PyConfig.inspect`

source: :c:var:`Py_OptimizeFlag`: use :c:member:`PyConfig.optimization_level`
it_it: :c:var:`Py_OptimizeFlag`: usa :c:member:`PyConfig.optimization_level`

source: :c:var:`Py_NoSiteFlag`: use :c:member:`PyConfig.site_import`
it_it: :c:var:`Py_NoSiteFlag`: usa :c:member:`PyConfig.site_import`

source: :c:var:`Py_BytesWarningFlag`: use :c:member:`PyConfig.bytes_warning`
it_it: :c:var:`Py_BytesWarningFlag`: usa :c:member:`PyConfig.bytes_warning`

source: :c:var:`Py_FrozenFlag`: use :c:member:`PyConfig.pathconfig_warnings`
it_it: :c:var:`Py_FrozenFlag`: usa :c:member:`PyConfig.pathconfig_warnings`

source: :c:var:`Py_IgnoreEnvironmentFlag`: use :c:member:`PyConfig.use_environment`
it_it: :c:var:`Py_IgnoreEnvironmentFlag`: usa :c:member:`PyConfig.use_environment`
