Repository: python/python-docs-it
Catalog: whatsnew/3.12.po
Languages: it_it

source: Remove support for obsolete browsers from :mod:`webbrowser`. The removed browsers include: Grail, Mosaic, Netscape, Galeon, Skipstone, Iceape, Firebird, and Firefox versions 35 and below (:gh:`102871`).
it_it: Rimuovi il supporto per i browser obsoleti da :mod:`webbrowser`. I browser rimossi includono: Grail, Mosaic, Netscape, Galeon, Skipstone, Iceape, Firebird e le versioni di Firefox fino alla 35 (:gh:`102871`).

source: Remove the ``ElementTree.Element.copy()`` method of the pure Python implementation, deprecated in Python 3.10, use the :func:`copy.copy` function instead. The C implementation of :mod:`xml.etree.ElementTree` has no ``copy()`` method, only a ``__copy__()`` method. (Contributed by Victor Stinner in :gh:`94383`.)
it_it: Rimuovi il metodo ``ElementTree.Element.copy()`` dell'implementazione pura in Python, deprecato in Python 3.10, usa invece la funzione :func:`copy.copy`. L'implementazione in C di :mod:`xml.etree.ElementTree` non ha metodo ``copy()``, ma solo un metodo ``__copy__()``. (Contribuito da Victor Stinner in :gh:`94383`.)

source: Remove :mod:`zipimport`'s ``find_loader()`` and ``find_module()`` methods, deprecated in Python 3.10: use the ``find_spec()`` method instead. See :pep:`451` for the rationale. (Contributed by Victor Stinner in :gh:`94379`.)
it_it: Rimuovi i metodi ``find_loader()`` e ``find_module()`` di :mod:`zipimport`, deprecati in Python 3.10: usa invece il metodo ``find_spec()``. Vedi :pep:`451` per la spiegazione. (Contribuito da Victor Stinner in :gh:`94379`.)

source: Others
it_it: Altri

source: Remove the ``suspicious`` rule from the documentation :file:`Makefile` and :file:`Doc/tools/rstlint.py`, both in favor of `sphinx-lint <https://github.com/sphinx-contrib/sphinx-lint>`_. (Contributed by Julien Palard in :gh:`98179`.)
it_it: Rimuovi la regola ``suspicious`` dal :file:`Makefile` della documentazione e da :file:`Doc/tools/rstlint.py`, entrambe a favore di `sphinx-lint <https://github.com/sphinx-contrib/sphinx-lint>`_. (Contribuito da Julien Palard in :gh:`98179`.)

source: Remove the *keyfile* and *certfile* parameters from the :mod:`ftplib`, :mod:`imaplib`, :mod:`poplib` and :mod:`smtplib` modules, and the *key_file*, *cert_file* and *check_hostname* parameters from the :mod:`http.client` module, all deprecated since Python 3.6. Use the *context* parameter (*ssl_context* in :mod:`imaplib`) instead. (Contributed by Victor Stinner in :gh:`94172`.)
it_it: Rimuovi i parametri *keyfile* e *certfile* dai moduli :mod:`ftplib`, :mod:`imaplib`, :mod:`poplib` e :mod:`smtplib`, e i parametri *key_file*, *cert_file* e *check_hostname* dal modulo :mod:`http.client`, tutti deprecati da Python 3.6. Usa invece il parametro *context* (*ssl_context* in :mod:`imaplib`). (Contribuito da Victor Stinner in :gh:`94172`.)

source: Remove ``Jython`` compatibility hacks from several stdlib modules and tests. (Contributed by Nikita Sobolev in :gh:`99482`.)
it_it: Rimuovi hack di compatibilità con ``Jython`` da diversi moduli e test della stdlib. (Contribuito da Nikita Sobolev in :gh:`99482`.)

source: Remove ``_use_broken_old_ctypes_structure_semantics_`` flag from :mod:`ctypes` module. (Contributed by Nikita Sobolev in :gh:`99285`.)
it_it: Rimuovi il flag ``_use_broken_old_ctypes_structure_semantics_`` dal modulo :mod:`ctypes`. (Contribuito da Nikita Sobolev in :gh:`99285`.)

source: Porting to Python 3.12
it_it: Porting a Python 3.12

source: This section lists previously described changes and other bugfixes that may require changes to your code.
it_it: Questa sezione elenca i cambiamenti precedentemente descritti e altre correzioni di bug che potrebbero richiedere modifiche al tuo codice.

source: Changes in the Python API
it_it: Modifiche nell'API di Python

source: More strict rules are now applied for numerical group references and group names in regular expressions. Only sequence of ASCII digits is now accepted as a numerical reference. The group name in bytes patterns and replacement strings can now only contain ASCII letters and digits and underscore. (Contributed by Serhiy Storchaka in :gh:`91760`.)
it_it: Ora si applicano regole più severe per i riferimenti di gruppo numerici e i nomi di gruppo nelle espressioni regolari. Sono accettati solo riferimenti numerici che sono una sequenza di cifre ASCII. Il nome del gruppo nei pattern in bytes e nelle stringhe di sostituzione ora può contenere solo lettere e cifre ASCII e il carattere di sottolineatura. (Contribuito da Serhiy Storchaka in :gh:`91760`.)

source: Remove ``randrange()`` functionality deprecated since Python 3.10. Formerly, ``randrange(10.0)`` losslessly converted to ``randrange(10)``. Now, it raises a :exc:`TypeError`. Also, the exception raised for non-integer values such as ``randrange(10.5)`` or ``randrange('10')`` has been changed from :exc:`ValueError` to :exc:`TypeError`. This also prevents bugs where ``randrange(1e25)`` would silently select from a larger range than ``randrange(10**25)``. (Originally suggested by Serhiy Storchaka :gh:`86388`.)
it_it: Rimosso il funzionamento di ``randrange()`` deprecato da Python 3.10. In precedenza, ``randrange(10.0)`` veniva convertito senza perdita a ``randrange(10)``. Ora solleva un'eccezione :exc:`TypeError`. Inoltre, l'eccezione sollevata per valori non interi come ``randrange(10.5)`` o ``randrange('10')`` è cambiata da :exc:`ValueError` a :exc:`TypeError`. Questo impedisce anche bug dove ``randrange(1e25)`` selezionava silenziosamente da un intervallo più ampio rispetto a ``randrange(10**25)``. (Originariamente suggerito da Serhiy Storchaka :gh:`86388`.)

source: :class:`argparse.ArgumentParser` changed encoding and error handler for reading arguments from file (e.g. ``fromfile_prefix_chars`` option) from default text encoding (e.g. :func:`locale.getpreferredencoding(False) <locale.getpreferredencoding>`) to :term:`filesystem encoding and error handler`. Argument files should be encoded in UTF-8 instead of ANSI Codepage on Windows.
it_it: :class:`argparse.ArgumentParser` ha cambiato la codifica e il gestore di errori per la lettura degli argomenti dai file (ad esempio l'opzione ``fromfile_prefix_chars``) dalla codifica di testo predefinita (ad esempio :func:`locale.getpreferredencoding(False) <locale.getpreferredencoding>`) a :term:`filesystem encoding and error handler`. I file degli argomenti dovrebbero essere codificati in UTF-8 invece che in ANSI Codepage su Windows.

source: Remove the ``asyncore``-based ``smtpd`` module deprecated in Python 3.4.7 and 3.5.4. A recommended replacement is the :mod:`asyncio`-based :pypi:`aiosmtpd` PyPI module.
it_it: Rimosso il modulo ``smtpd`` basato su ``asyncore`` deprecato in Python 3.4.7 e 3.5.4. Una sostituzione raccomandata è il modulo PyPI :mod:`asyncio`-based :pypi:`aiosmtpd`.

source: :func:`shlex.split`: Passing ``None`` for *s* argument now raises an exception, rather than reading :data:`sys.stdin`. The feature was deprecated in Python 3.9. (Contributed by Victor Stinner in :gh:`94352`.)
it_it: :func:`shlex.split`: Passare ``None`` per l'argomento *s* ora solleva un'eccezione, invece di leggere da :data:`sys.stdin`. La funzionalità è stata deprecata in Python 3.9. (Contribuito da Victor Stinner in :gh:`94352`.)

source: The :mod:`os` module no longer accepts bytes-like paths, like :class:`bytearray` and :class:`memoryview` types: only the exact :class:`bytes` type is accepted for bytes strings. (Contributed by Victor Stinner in :gh:`98393`.)
it_it: Il modulo :mod:`os` non accetta più percorsi di tipo bytes, come :class:`bytearray` e :class:`memoryview`: solo il tipo esatto :class:`bytes` è accettato per stringhe di tipo bytes. (Contribuito da Victor Stinner in :gh:`98393`.)

source: :func:`syslog.openlog` and :func:`syslog.closelog` now fail if used in subinterpreters. :func:`syslog.syslog` may still be used in subinterpreters, but now only if :func:`syslog.openlog` has already been called in the main interpreter. These new restrictions do not apply to the main interpreter, so only a very small set of users might be affected. This change helps with interpreter isolation. Furthermore, :mod:`syslog` is a wrapper around process-global resources, which are best managed from the main interpreter. (Contributed by Donghee Na in :gh:`99127`.)
it_it: :func:`syslog.openlog` e :func:`syslog.closelog` ora falliscono se utilizzati nei subinterpreti. :func:`syslog.syslog` può ancora essere usato nei subinterpreti, ma solo se :func:`syslog.openlog` è stato già chiamato nel main interpreter. Queste nuove restrizioni non si applicano al main interpreter, quindi solo un insieme molto ristretto di utenti potrebbe essere interessato. Questa modifica aiuta con l'isolamento degli interpreti. Inoltre, :mod:`syslog` è un wrapper attorno a risorse globali del processo, che sono meglio gestite dal main interpreter. (Contribuito da Donghee Na in :gh:`99127`.)

source: The undocumented locking behavior of :func:`~functools.cached_property` is removed, because it locked across all instances of the class, leading to high lock contention. This means that a cached property getter function could now run more than once for a single instance, if two threads race. For most simple cached properties (e.g. those that are idempotent and simply calculate a value based on other attributes of the instance) this will be fine. If synchronization is needed, implement locking within the cached property getter function or around multi-threaded access points.
it_it: Il comportamento di blocco non documentato di :func:`~functools.cached_property` è stato rimosso, perché bloccava tutte le istanze della classe, portando a una forte contention dei lock. Questo significa che ora una funzione getter della proprietà in cache potrebbe essere eseguita più di una volta per una singola istanza, se due thread sono in competizione. Per la maggior parte delle proprietà in cache semplici (ad esempio quelle che sono idempotenti e calcolano semplicemente un valore basato su altri attributi dell'istanza) questo sarà accettabile. Se è necessaria la sincronizzazione, implementare il locking all'interno della funzione getter della proprietà in cache o intorno ai punti di accesso multi-thread.

source: When extracting tar files using :mod:`tarfile` or :func:`shutil.unpack_archive`, pass the *filter* argument to limit features that may be surprising or dangerous. See :ref:`tarfile-extraction-filter` for details.
it_it: Quando si estraggono file tar usando :mod:`tarfile` o :func:`shutil.unpack_archive`, passare l'argomento *filter* per limitare le funzionalità che possono essere sorprendenti o pericolose. Vedere :ref:`tarfile-extraction-filter` per i dettagli.

source: The output of the :func:`tokenize.tokenize` and :func:`tokenize.generate_tokens` functions is now changed due to the changes introduced in :pep:`701`. This means that ``STRING`` tokens are not emitted any more for f-strings and the tokens described in :pep:`701` are now produced instead: ``FSTRING_START``, ``FSTRING_MIDDLE`` and ``FSTRING_END`` are now emitted for f-string "string" parts in addition to the appropriate tokens for the tokenization in the expression components. For example for the f-string ``f"start {1+1} end"`` the old version of the tokenizer emitted::
it_it: L'output delle funzioni :func:`tokenize.tokenize` e :func:`tokenize.generate_tokens` è ora cambiato a causa delle modifiche introdotte in :pep:`701`. Questo significa che i token ``STRING`` non sono più emessi per le f-string e i token descritti in :pep:`701` sono ora prodotti al loro posto: ``FSTRING_START``, ``FSTRING_MIDDLE`` e ``FSTRING_END`` sono ora emessi per le parti "string" delle f-string in aggiunta ai token appropriati per la tokenizzazione nei componenti di espressione. Ad esempio, per la f-string ``f"start {1+1} end"`` la vecchia versione del tokenizer emetteva::

source: while the new version emits::
it_it: mentre la nuova versione emette::

source: Additionally, there may be some minor behavioral changes as a consequence of the changes required to support :pep:`701`. Some of these changes include:
it_it: Inoltre, potrebbero esserci alcuni cambiamenti comportamentali minori come conseguenza delle modifiche necessarie per supportare :pep:`701`. Alcuni di questi cambiamenti includono:

source: The ``type`` attribute of the tokens emitted when tokenizing some invalid Python characters such as ``!`` has changed from ``ERRORTOKEN`` to ``OP``.
it_it: L'attributo ``type`` dei token emessi quando si tokenizzano alcuni caratteri Python non validi come ``!`` è cambiato da ``ERRORTOKEN`` a ``OP``.

source: Incomplete single-line strings now also raise :exc:`tokenize.TokenError` as incomplete multiline strings do.
it_it: Le stringhe a riga singola incomplete ora sollevano :exc:`tokenize.TokenError` come fanno le stringhe multilinea incomplete.

source: Some incomplete or invalid Python code now raises :exc:`tokenize.TokenError` instead of returning arbitrary ``ERRORTOKEN`` tokens when tokenizing it.
it_it: Alcuni codici Python incompleti o non validi ora sollevano :exc:`tokenize.TokenError` invece di restituire token ``ERRORTOKEN`` arbitrari durante la tokenizzazione.

source: Mixing tabs and spaces as indentation in the same file is not supported anymore and will raise a :exc:`TabError`.
it_it: La miscelazione di tabulazioni e spazi come indentazione nello stesso file non è più supportata e genererà un'eccezione :exc:`TabError`.

source: The :mod:`threading` module now expects the :mod:`!_thread` module to have an ``_is_main_interpreter`` attribute. It is a function with no arguments that returns ``True`` if the current interpreter is the main interpreter.
it_it: Il modulo :mod:`threading` ora si aspetta che il modulo :mod:`!_thread` abbia un attributo ``_is_main_interpreter``. È una funzione senza argomenti che restituisce ``True`` se l'interprete corrente è il main interpreter.

source: Any library or application that provides a custom ``_thread`` module should provide ``_is_main_interpreter()``. (See :gh:`112826`.)
it_it: Qualsiasi libreria o applicazione che fornisce un modulo ``_thread`` personalizzato dovrebbe fornire ``_is_main_interpreter()``. (Vedere :gh:`112826`.)

source: Build Changes
it_it: Modifiche alla Build

source: Python no longer uses :file:`setup.py` to build shared C extension modules. Build parameters like headers and libraries are detected in ``configure`` script. Extensions are built by :file:`Makefile`. Most extensions use ``pkg-config`` and fall back to manual detection. (Contributed by Christian Heimes in :gh:`93939`.)
it_it: Python non utilizza più :file:`setup.py` per costruire moduli di estensione C condivisi. I parametri di build come intestazioni e librerie sono rilevati nello script ``configure``. Le estensioni sono costruite da :file:`Makefile`. La maggior parte delle estensioni utilizza ``pkg-config`` e ricorre al rilevamento manuale. (Contribuito da Christian Heimes in :gh:`93939`.)

source: ``va_start()`` with two parameters, like ``va_start(args, format),`` is now required to build Python. ``va_start()`` is no longer called with a single parameter. (Contributed by Kumar Aditya in :gh:`93207`.)
it_it: ``va_start()`` con due parametri, come ``va_start(args, format),`` è ora richiesto per costruire Python. ``va_start()`` non viene più chiamato con un solo parametro. (Contribuito da Kumar Aditya in :gh:`93207`.)

source: CPython now uses the ThinLTO option as the default link time optimization policy if the Clang compiler accepts the flag. (Contributed by Donghee Na in :gh:`89536`.)
it_it: CPython ora utilizza l'opzione ThinLTO come politica predefinita di ottimizzazione del tempo di link se il compilatore Clang accetta il flag. (Contribuito da Donghee Na in :gh:`89536`.)

source: Add ``COMPILEALL_OPTS`` variable in :file:`Makefile` to override :mod:`compileall` options (default: ``-j0``) in ``make install``. Also merged the 3 ``compileall`` commands into a single command to build .pyc files for all optimization levels (0, 1, 2) at once. (Contributed by Victor Stinner in :gh:`99289`.)
it_it: Aggiunta la variabile ``COMPILEALL_OPTS`` in :file:`Makefile` per sovrascrivere le opzioni di :mod:`compileall` (predefinito: ``-j0``) in ``make install``. Inoltre, combinati i 3 comandi ``compileall`` in un unico comando per costruire i file .pyc per tutti i livelli di ottimizzazione (0, 1, 2) in una volta. (Contribuito da Victor Stinner in :gh:`99289`.)

source: Add platform triplets for 64-bit LoongArch:
it_it: Aggiunti triplette di piattaforma per LoongArch a 64 bit:

source: (Contributed by Zhang Na in :gh:`90656`.)
it_it: (Contribuito da Zhang Na in :gh:`90656`.)

source: ``PYTHON_FOR_REGEN`` now require Python 3.10 or newer.
it_it: ``PYTHON_FOR_REGEN`` ora richiede Python 3.10 o versioni successive.

source: Autoconf 2.71 and aclocal 1.16.4 is now required to regenerate :file:`!configure`. (Contributed by Christian Heimes in :gh:`89886`.)
it_it: Autoconf 2.71 e aclocal 1.16.4 sono ora richiesti per rigenerare :file:`!configure`. (Contribuito da Christian Heimes in :gh:`89886`.)

source: Windows builds and macOS installers from python.org now use OpenSSL 3.0.
it_it: Le build di Windows e gli installer per macOS da python.org ora utilizzano OpenSSL 3.0.

source: C API Changes
it_it: Modifiche all'API C

source: :pep:`697`: Introduce the :ref:`Unstable C API tier <unstable-c-api>`, intended for low-level tools like debuggers and JIT compilers. This API may change in each minor release of CPython without deprecation warnings. Its contents are marked by the ``PyUnstable_`` prefix in names.
it_it: :pep:`697`: Introdotta la :ref:`Unstable C API tier <unstable-c-api>`, destinata a strumenti di basso livello come debugger e compilatori JIT. Questa API può cambiare in ogni rilascio minore di CPython senza avvisi di deprecazione. I suoi contenuti sono contrassegnati dal prefisso ``PyUnstable_`` nei nomi.

source: Code object constructors:
it_it: Costruttori di oggetti Code:

source: ``PyUnstable_Code_New()`` (renamed from ``PyCode_New``)
it_it: ``PyUnstable_Code_New()`` (rinominato da ``PyCode_New``)

source: ``PyUnstable_Code_NewWithPosOnlyArgs()`` (renamed from ``PyCode_NewWithPosOnlyArgs``)
it_it: ``PyUnstable_Code_NewWithPosOnlyArgs()`` (rinominato da ``PyCode_NewWithPosOnlyArgs``)

source: Extra storage for code objects (:pep:`523`):
it_it: Archiviazione extra per oggetti code (:pep:`523`):

source: ``PyUnstable_Eval_RequestCodeExtraIndex()`` (renamed from ``_PyEval_RequestCodeExtraIndex``)
it_it: ``PyUnstable_Eval_RequestCodeExtraIndex()`` (rinominato da ``_PyEval_RequestCodeExtraIndex``)

source: ``PyUnstable_Code_GetExtra()`` (renamed from ``_PyCode_GetExtra``)
it_it: ``PyUnstable_Code_GetExtra()`` (rinominato da ``_PyCode_GetExtra``)

source: ``PyUnstable_Code_SetExtra()`` (renamed from ``_PyCode_SetExtra``)
it_it: ``PyUnstable_Code_SetExtra()`` (rinominato da ``_PyCode_SetExtra``)

source: The original names will continue to be available until the respective API changes.
it_it: I nomi originali continueranno a essere disponibili fino alla rispettiva modifica dell'API.

source: (Contributed by Petr Viktorin in :gh:`101101`.)
it_it: (Contribuito da Petr Viktorin in :gh:`101101`.)

source: :pep:`697`: Add an API for extending types whose instance memory layout is opaque:
it_it: :pep:`697`: Aggiunta un'API per estendere i tipi la cui struttura di memoria delle istanze è opaca:

source: :c:member:`PyType_Spec.basicsize` can be zero or negative to specify inheriting or extending the base class size.
it_it: :c:member:`PyType_Spec.basicsize` può essere zero o negativo per specificare l'ereditarietà o l'estensione della dimensione della classe base.

source: :c:func:`PyObject_GetTypeData` and :c:func:`PyType_GetTypeDataSize` added to allow access to subclass-specific instance data.
it_it: :c:func:`PyObject_GetTypeData` e :c:func:`PyType_GetTypeDataSize` aggiunti per consentire l'accesso ai dati di istanza specifici della sottoclasse.

source: :c:macro:`Py_TPFLAGS_ITEMS_AT_END` and :c:func:`PyObject_GetItemData` added to allow safely extending certain variable-sized types, including :c:var:`PyType_Type`.
it_it: :c:macro:`Py_TPFLAGS_ITEMS_AT_END` e :c:func:`PyObject_GetItemData` aggiunti per consentire l'estensione sicura di determinati tipi a dimensione variabile, incluso :c:var:`PyType_Type`.

source: :c:macro:`Py_RELATIVE_OFFSET` added to allow defining :c:type:`members <PyMemberDef>` in terms of a subclass-specific struct.
it_it: :c:macro:`Py_RELATIVE_OFFSET` aggiunto per consentire la definizione di :c:type:`membri <PyMemberDef>` in termini di una struttura specifica della sottoclasse.

source: (Contributed by Petr Viktorin in :gh:`103509`.)
it_it: (Contribuito da Petr Viktorin in :gh:`103509`.)

source: Add the new :ref:`limited C API <limited-c-api>` function :c:func:`PyType_FromMetaclass`, which generalizes the existing :c:func:`PyType_FromModuleAndSpec` using an additional metaclass argument. (Contributed by Wenzel Jakob in :gh:`93012`.)
it_it: Aggiunta la nuova funzione della :ref:`limited C API <limited-c-api>` :c:func:`PyType_FromMetaclass`, che generalizza l'esistente :c:func:`PyType_FromModuleAndSpec` utilizzando un argomento metaclasse aggiuntivo. (Contribuito da Wenzel Jakob in :gh:`93012`.)

source: API for creating objects that can be called using :ref:`the vectorcall protocol <vectorcall>` was added to the :ref:`Limited API <stable>`:
it_it: È stata aggiunta un'API per creare oggetti che possono essere chiamati utilizzando :ref:`il protocollo vectorcall <vectorcall>` alla :ref:`Limited API <stable>`:

source: The :c:macro:`Py_TPFLAGS_HAVE_VECTORCALL` flag is now removed from a class when the class's :py:meth:`~object.__call__` method is reassigned. This makes vectorcall safe to use with mutable types (i.e. heap types without the immutable flag, :c:macro:`Py_TPFLAGS_IMMUTABLETYPE`). Mutable types that do not override :c:member:`~PyTypeObject.tp_call` now inherit the ``Py_TPFLAGS_HAVE_VECTORCALL`` flag. (Contributed by Petr Viktorin in :gh:`93274`.)
it_it: Il flag :c:macro:`Py_TPFLAGS_HAVE_VECTORCALL` viene ora rimosso da una classe quando il metodo della classe :py:meth:`~object.__call__` viene riassegnato. Questo rende sicuro l'uso di vectorcall con tipi mutabili (cioè tipi di heap senza il flag immutabile, :c:macro:`Py_TPFLAGS_IMMUTABLETYPE`). I tipi mutabili che non sovrascrivono :c:member:`~PyTypeObject.tp_call` ora ereditano il flag ``Py_TPFLAGS_HAVE_VECTORCALL``. (Contributo di Petr Viktorin in :gh:`93274`.)

source: The :c:macro:`Py_TPFLAGS_MANAGED_DICT` and :c:macro:`Py_TPFLAGS_MANAGED_WEAKREF` flags have been added. This allows extensions classes to support object ``__dict__`` and weakrefs with less bookkeeping, using less memory and with faster access.
it_it: Sono stati aggiunti i flag :c:macro:`Py_TPFLAGS_MANAGED_DICT` e :c:macro:`Py_TPFLAGS_MANAGED_WEAKREF`. Questo consente alle classi estese di supportare ``__dict__`` e weakref degli oggetti con meno gestione, usando meno memoria e con accesso più rapido.

source: API for performing calls using :ref:`the vectorcall protocol <vectorcall>` was added to the :ref:`Limited API <stable>`:
it_it: È stata aggiunta all' :ref:`Limited API <stable>` l'API per eseguire chiamate utilizzando :ref:`il protocollo vectorcall <vectorcall>`:

source: This means that both the incoming and outgoing ends of the vector call protocol are now available in the :ref:`Limited API <stable>`. (Contributed by Wenzel Jakob in :gh:`98586`.)
it_it: Questo significa che entrambe le estremità, in entrata e in uscita, del protocollo vectorcall sono ora disponibili nella :ref:`Limited API <stable>`. (Contributo di Wenzel Jakob in :gh:`98586`.)
