Repository: python/python-docs-it
Catalog: whatsnew/3.12.po
Languages: it_it

source: What's New In Python 3.12
it_it: Novità in Python 3.12

source: This article explains the new features in Python 3.12, compared to 3.11. Python 3.12 was released on October 2, 2023. For full details, see the :ref:`changelog <changelog>`.
it_it: Questo articolo spiega le nuove funzionalità in Python 3.12, rispetto alla versione 3.11. Python 3.12 è stato rilasciato il 2 ottobre 2023. Per i dettagli completi, consultare il :ref:`changelog <changelog>`.

source: :pep:`693` -- Python 3.12 Release Schedule
it_it: :pep:`693` -- Programma di rilascio di Python 3.12

source: Summary -- Release highlights
it_it: Sommario -- Punti salienti del rilascio

source: Python 3.12 is the latest stable release of the Python programming language, with a mix of changes to the language and the standard library. The library changes focus on cleaning up deprecated APIs, usability, and correctness. Of note, the :mod:`!distutils` package has been removed from the standard library. Filesystem support in :mod:`os` and :mod:`pathlib` has seen a number of improvements, and several modules have better performance.
it_it: Python 3.12 è l'ultima versione stabile del linguaggio di programmazione Python, che ha portato a una serie di cambiamenti al linguaggio e alla libreria standard. Le modifiche alla libreria si concentrano sulla pulizia delle API deprecate, l'usabilità e la correttezza. Da notare, il pacchetto :mod:`!distutils` è stato rimosso dalla libreria standard. Il supporto ai file system in :mod:`os` e :mod:`pathlib` ha visto numerosi miglioramenti, e diversi moduli hanno ora una performance migliore.

source: The language changes focus on usability, as :term:`f-strings <f-string>` have had many limitations removed and 'Did you mean ...' suggestions continue to improve. The new :ref:`type parameter syntax <whatsnew312-pep695>` and :keyword:`type` statement improve ergonomics for using :term:`generic types <generic type>` and :term:`type aliases <type alias>` with static type checkers.
it_it: Le modifiche al linguaggio si concentrano sull'usabilità, in quanto molte limitazioni dei :term:`f-strings <f-string>` sono state rimosse e i suggerimenti 'Intendevi dire ...' continuano a migliorare. La nuova :ref:`sintassi dei parametri di tipo <whatsnew312-pep695>` e l'istruzione :keyword:`type` migliorano l'ergonomia per l'utilizzo di :term:`tipi generici <generic type>` e :term:`alias di tipo <type alias>` con i checker di tipo statico.

source: This article doesn't attempt to provide a complete specification of all new features, but instead gives a convenient overview. For full details, you should refer to the documentation, such as the :ref:`Library Reference <library-index>` and :ref:`Language Reference <reference-index>`. If you want to understand the complete implementation and design rationale for a change, refer to the PEP for a particular new feature; but note that PEPs usually are not kept up-to-date once a feature has been fully implemented.
it_it: Questo articolo non tenta di fornire una specifica completa di tutte le nuove funzionalità, ma offre invece una panoramica. Per i dettagli completi, dovresti fare riferimento alla documentazione, come il :ref:`Library Reference <library-index>` e il :ref:`Language Reference <reference-index>`. Se vuoi comprendere l'implementazione completa e la motivazione dietro una modifica, fai riferimento al PEP per una particolare nuova funzionalità; ma tieni presente che i PEP di solito non vengono aggiornati una volta che una funzionalità è stata completamente implementata.

source: New syntax features:
it_it: Nuove funzionalità sintattiche:

source: :ref:`PEP 695 <whatsnew312-pep695>`, type parameter syntax and the :keyword:`type` statement
it_it: :ref:`PEP 695 <whatsnew312-pep695>`, sintassi dei parametri di tipo e l'istruzione :keyword:`type`

source: New grammar features:
it_it: Nuove funzionalità grammaticali:

source: :ref:`PEP 701 <whatsnew312-pep701>`, :term:`f-strings <f-string>` in the grammar
it_it: :ref:`PEP 701 <whatsnew312-pep701>`, :term:`f-strings <f-string>` nella grammatica

source: Interpreter improvements:
it_it: Miglioramenti dell'interprete:

source: :ref:`PEP 684 <whatsnew312-pep684>`, a unique per-interpreter :term:`GIL <global interpreter lock>`
it_it: :ref:`PEP 684 <whatsnew312-pep684>`, un :term:`GIL <global interpreter lock>` univoco per interprete

source: :ref:`PEP 669 <whatsnew312-pep669>`, low impact monitoring
it_it: :ref:`PEP 669 <whatsnew312-pep669>`, monitoraggio a basso impatto

source: `Improved 'Did you mean ...' suggestions <improved error messages_>`_ for :exc:`NameError`, :exc:`ImportError`, and :exc:`SyntaxError` exceptions
it_it: `Suggerimenti migliorati 'Intendevi dire ...' <improved error messages_>`_ per eccezioni :exc:`NameError`, :exc:`ImportError`, e :exc:`SyntaxError`

source: Python data model improvements:
it_it: Miglioramenti al modello di dati di Python:

source: :ref:`PEP 688 <whatsnew312-pep688>`, using the :ref:`buffer protocol <bufferobjects>` from Python
it_it: :ref:`PEP 688 <whatsnew312-pep688>`, usando il :ref:`protocollo del buffer <bufferobjects>` da Python

source: Significant improvements in the standard library:
it_it: Miglioramenti significativi nella libreria standard:

source: The :class:`pathlib.Path` class now supports subclassing
it_it: La classe :class:`pathlib.Path` ora supporta la sottoclassificazione

source: The :mod:`os` module received several improvements for Windows support
it_it: Il modulo :mod:`os` ha ricevuto diversi miglioramenti per il supporto di Windows

source: A :ref:`command-line interface <sqlite3-cli>` has been added to the :mod:`sqlite3` module
it_it: Un'interfaccia a riga di comando :ref:`interface <sqlite3-cli>` è stata aggiunta al modulo :mod:`sqlite3`

source: :func:`isinstance` checks against :func:`runtime-checkable protocols <typing.runtime_checkable>` enjoy a speed up of between two and 20 times
it_it: I controlli :func:`isinstance` contro i protocolli :func:`runtime-checkable <typing.runtime_checkable>` godono di un'accelerazione tra due e 20 volte

source: The :mod:`asyncio` package has had a number of performance improvements, with some benchmarks showing a 75% speed up.
it_it: Il pacchetto :mod:`asyncio` ha avuto numerosi miglioramenti di performance, con alcuni benchmark che mostrano un'accelerazione del 75%.

source: A :ref:`command-line interface <uuid-cli>` has been added to the :mod:`uuid` module
it_it: Un'interfaccia a riga di comando :ref:`interface <uuid-cli>` è stata aggiunta al modulo :mod:`uuid`

source: Due to the changes in :ref:`PEP 701 <whatsnew312-pep701>`, producing tokens via the :mod:`tokenize` module is up to 64% faster.
it_it: A causa delle modifiche nel :ref:`PEP 701 <whatsnew312-pep701>`, la produzione di token tramite il modulo :mod:`tokenize` è fino al 64% più veloce.

source: Security improvements:
it_it: Miglioramenti alla sicurezza:

source: Replace the builtin :mod:`hashlib` implementations of SHA1, SHA3, SHA2-384, SHA2-512, and MD5 with formally verified code from the `HACL* <https://github.com/hacl-star/hacl-star/>`__ project. These builtin implementations remain as fallbacks that are only used when OpenSSL does not provide them.
it_it: Sostituire le implementazioni integrate del modulo :mod:`hashlib` di SHA1, SHA3, SHA2-384, SHA2-512 e MD5 con codice formalmente verificato dal progetto `HACL* <https://github.com/hacl-star/hacl-star/>`__. Queste implementazioni integrate rimangono come fallback che vengono utilizzate solo quando OpenSSL non le fornisce.

source: C API improvements:
it_it: Miglioramenti all'API C:

source: :ref:`PEP 697 <whatsnew312-pep697>`, unstable C API tier
it_it: :ref:`PEP 697 <whatsnew312-pep697>`, livello instabile dell'API C

source: :ref:`PEP 683 <whatsnew312-pep683>`, immortal objects
it_it: :ref:`PEP 683 <whatsnew312-pep683>`, oggetti immortali

source: CPython implementation improvements:
it_it: Miglioramenti all'implementazione di CPython:

source: :ref:`PEP 709 <whatsnew312-pep709>`, comprehension inlining
it_it: :ref:`PEP 709 <whatsnew312-pep709>`, inlining delle comprensioni

source: :ref:`CPython support <perf_profiling>` for the Linux ``perf`` profiler
it_it: :ref:`Supporto CPython <perf_profiling>` per il profiler ``perf`` su Linux

source: Implement stack overflow protection on supported platforms
it_it: Implementare la protezione da overflow dello stack su piattaforme supportate

source: New typing features:
it_it: Nuove funzionalità di typing:

source: :ref:`PEP 692 <whatsnew312-pep692>`, using :class:`~typing.TypedDict` to annotate :term:`**kwargs <argument>`
it_it: :ref:`PEP 692 <whatsnew312-pep692>`, utilizzo di :class:`~typing.TypedDict` per annotare :term:`**kwargs <argument>`

source: :ref:`PEP 698 <whatsnew312-pep698>`, :func:`typing.override` decorator
it_it: :ref:`PEP 698 <whatsnew312-pep698>`, decoratore :func:`typing.override`

source: Important deprecations, removals or restrictions:
it_it: Deprecazioni, rimozioni o restrizioni importanti:

source: :pep:`623`: Remove ``wstr`` from Unicode objects in Python's C API, reducing the size of every :class:`str` object by at least 8 bytes.
it_it: :pep:`623`: Rimuovere ``wstr`` dagli oggetti Unicode nell'API C di Python, riducendo la dimensione di ogni oggetto :class:`str` di almeno 8 byte.

source: :pep:`632`: Remove the :mod:`!distutils` package. See `the migration guide <https://peps.python.org/pep-0632/#migration-advice>`_ for advice replacing the APIs it provided. The third-party `Setuptools <https://setuptools.pypa.io/en/latest/deprecated/distutils-legacy.html>`__ package continues to provide :mod:`!distutils`, if you still require it in Python 3.12 and beyond.
it_it: :pep:`632`: Rimuovere il pacchetto :mod:`!distutils`. Vedi `la guida alla migrazione <https://peps.python.org/pep-0632/#migration-advice>`_ per consigli sulla sostituzione delle API che forniva. Il pacchetto di terze parti `Setuptools <https://setuptools.pypa.io/en/latest/deprecated/distutils-legacy.html>`__ continua a fornire :mod:`!distutils`, se ne hai ancora bisogno in Python 3.12 e oltre.

source: :gh:`95299`: Do not pre-install ``setuptools`` in virtual environments created with :mod:`venv`. This means that ``distutils``, ``setuptools``, ``pkg_resources``, and ``easy_install`` will no longer available by default; to access these run ``pip install setuptools`` in the :ref:`activated <venv-explanation>` virtual environment.
it_it: :gh:`95299`: Non preinstallare ``setuptools`` negli ambienti virtuali creati con :mod:`venv`. Ciò significa che ``distutils``, ``setuptools``, ``pkg_resources`` e ``easy_install`` non saranno più disponibili di default; per accedervi eseguire ``pip install setuptools`` nell'ambiente virtuale :ref:`attivato <venv-explanation>`.

source: The :mod:`!asynchat`, :mod:`!asyncore`, and :mod:`!imp` modules have been removed, along with several :class:`unittest.TestCase` `method aliases <unittest-TestCase-removed-aliases_>`_.
it_it: I moduli :mod:`!asynchat`, :mod:`!asyncore` e :mod:`!imp` sono stati rimossi, insieme a diversi `alias di metodo <unittest-TestCase-removed-aliases_>`_ di :class:`unittest.TestCase`.

source: New Features
it_it: Nuove Funzionalità

source: PEP 695: Type Parameter Syntax
it_it: PEP 695: Sintassi dei Parametri di Tipo

source: Generic classes and functions under :pep:`484` were declared using a verbose syntax that left the scope of type parameters unclear and required explicit declarations of variance.
it_it: Le classi generiche e le funzioni sotto :pep:`484` erano dichiarate utilizzando una sintassi verbosa che lasciava poco chiaro l'ambito dei parametri di tipo e richiedeva dichiarazioni esplicite di varianza.

source: :pep:`695` introduces a new, more compact and explicit way to create :ref:`generic classes <generic-classes>` and :ref:`functions <generic-functions>`::
it_it: :pep:`695` introduce un nuovo modo, più compatto ed esplicito, per creare :ref:`classi generiche <generic-classes>` e :ref:`funzioni <generic-functions>`::

source: In addition, the PEP introduces a new way to declare :ref:`type aliases <type-aliases>` using the :keyword:`type` statement, which creates an instance of :class:`~typing.TypeAliasType`::
it_it: Inoltre, il PEP introduce un nuovo modo di dichiarare :ref:`alias di tipo <type-aliases>` utilizzando l'istruzione :keyword:`type`, che crea un'istanza di :class:`~typing.TypeAliasType`::

source: Type aliases can also be :ref:`generic <generic-type-aliases>`::
it_it: Gli alias di tipo possono anche essere :ref:`generici <generic-type-aliases>`::

source: The new syntax allows declaring :class:`~typing.TypeVarTuple` and :class:`~typing.ParamSpec` parameters, as well as :class:`~typing.TypeVar` parameters with bounds or constraints::
it_it: La nuova sintassi consente di dichiarare parametri :class:`~typing.TypeVarTuple` e :class:`~typing.ParamSpec`, nonché parametri :class:`~typing.TypeVar` con limiti o vincoli::

source: The value of type aliases and the bound and constraints of type variables created through this syntax are evaluated only on demand (see :ref:`lazy evaluation <lazy-evaluation>`). This means type aliases are able to refer to other types defined later in the file.
it_it: Il valore degli alias di tipo e i limiti e vincoli delle variabili di tipo creati con questa sintassi sono valutati solo su richiesta (vedi :ref:`lazy evaluation <lazy-evaluation>`). Ciò significa che gli alias di tipo possono riferirsi ad altri tipi definiti successivamente nel file.

source: Type parameters declared through a type parameter list are visible within the scope of the declaration and any nested scopes, but not in the outer scope. For example, they can be used in the type annotations for the methods of a generic class or in the class body. However, they cannot be used in the module scope after the class is defined. See :ref:`type-params` for a detailed description of the runtime semantics of type parameters.
it_it: I parametri di tipo dichiarati attraverso una lista di parametri di tipo sono visibili all'interno dell'ambito della dichiarazione e in qualsiasi ambito annidato, ma non nell'ambito esterno. Ad esempio, possono essere utilizzati nelle annotazioni di tipo per i metodi di una classe generica o nel corpo della classe. Tuttavia, non possono essere utilizzati nell'ambito del modulo dopo che la classe è stata definita. Vedi :ref:`type-params` per una descrizione dettagliata della semantica di runtime dei parametri di tipo.

source: In order to support these scoping semantics, a new kind of scope is introduced, the :ref:`annotation scope <annotation-scopes>`. Annotation scopes behave for the most part like function scopes, but interact differently with enclosing class scopes. In Python 3.13, :term:`annotations <annotation>` will also be evaluated in annotation scopes.
it_it: Per supportare questa semantica di ambito, è stato introdotto un nuovo tipo di ambito, l':ref:`annotation scope <annotation-scopes>`. Gli ambiti di annotazione si comportano per lo più come gli ambiti delle funzioni, ma interagiscono in modo diverso con gli ambiti della classe che li contengono. In Python 3.13, le :term:`annotazioni <annotation>` saranno valutate negli ambiti di annotazione.

source: See :pep:`695` for more details.
it_it: Vedi :pep:`695` per ulteriori dettagli.

source: (PEP written by Eric Traut. Implementation by Jelle Zijlstra, Eric Traut, and others in :gh:`103764`.)
it_it: (PEP scritto da Eric Traut. Implementazione di Jelle Zijlstra, Eric Traut e altri in :gh:`103764`.)

source: PEP 701: Syntactic formalization of f-strings
it_it: PEP 701: Formalizzazione sintattica delle f-string

source: :pep:`701` lifts some restrictions on the usage of :term:`f-strings <f-string>`. Expression components inside f-strings can now be any valid Python expression, including strings reusing the same quote as the containing f-string, multi-line expressions, comments, backslashes, and unicode escape sequences. Let's cover these in detail:
it_it: :pep:`701` rimuove alcune restrizioni sull'uso delle :term:`f-string <f-string>`. Gli elementi dell'espressione all'interno delle f-string possono ora essere qualsiasi espressione Python valida, incluse stringhe che riutilizzano la stessa virgoletta della f-string contenente, espressioni multilinea, commenti, backslash e sequenze di escape unicode. Approfondiamo questi aspetti in dettaglio:

source: Quote reuse: in Python 3.11, reusing the same quotes as the enclosing f-string raises a :exc:`SyntaxError`, forcing the user to either use other available quotes (like using double quotes or triple quotes if the f-string uses single quotes). In Python 3.12, you can now do things like this:
it_it: Riutilizzo delle virgolette: in Python 3.11, riutilizzare le stesse virgolette della f-string contenente genera un'eccezione :exc:`SyntaxError`, costringendo l'utente a utilizzare altre virgolette disponibili (come l'uso delle virgolette doppie o delle virgolette triple se la f-string usa virgolette singole). In Python 3.12, è ora possibile fare cose come questa:

source: Note that before this change there was no explicit limit in how f-strings can be nested, but the fact that string quotes cannot be reused inside the expression component of f-strings made it impossible to nest f-strings arbitrarily. In fact, this is the most nested f-string that could be written:
it_it: Prima di questa modifica non esisteva un limite esplicito su come le f-string potessero essere annidate, ma il fatto che le virgolette delle stringhe non potessero essere riutilizzate all'interno dell'elemento di espressione delle f-string rendeva impossibile annidare le f-string arbitrariamente. Infatti, questa è l'f-string più annidata che poteva essere scritta:

source: As now f-strings can contain any valid Python expression inside expression components, it is now possible to nest f-strings arbitrarily:
it_it: Poiché ora le f-string possono contenere qualsiasi espressione Python valida all'interno degli elementi di espressione, è ora possibile annidare le f-string arbitrariamente:

source: Multi-line expressions and comments: In Python 3.11, f-string expressions must be defined in a single line, even if the expression within the f-string could normally span multiple lines (like literal lists being defined over multiple lines), making them harder to read. In Python 3.12 you can now define f-strings spanning multiple lines, and add inline comments:
it_it: Espressioni multilinea e commenti: in Python 3.11, le espressioni all'interno delle f-string devono essere definite in una singola riga, anche se l'espressione all'interno della f-string potrebbe normalmente estendersi su più righe (come le liste letterali definite su più righe), rendendole più difficili da leggere. In Python 3.12 è ora possibile definire f-string che si estendono su più righe e aggiungere commenti in linea:

source: Backslashes and unicode characters: before Python 3.12 f-string expressions couldn't contain any ``\`` character. This also affected unicode :ref:`escape sequences <escape-sequences>` (such as ``\N{snowman}``) as these contain the ``\N`` part that previously could not be part of expression components of f-strings. Now, you can define expressions like this:
it_it: Backslash e caratteri unicode: prima di Python 3.12, le espressioni f-string non potevano contenere alcun carattere ``\``. Questo influenzava anche le :ref:`sequenze di escape <escape-sequences>` unicode (come ``\N{snowman}``) poiché contengono la parte ``\N`` che prima non poteva far parte degli elementi di espressione delle f-string. Ora puoi definire espressioni come questa:

source: See :pep:`701` for more details.
it_it: Vedi :pep:`701` per ulteriori dettagli.

source: As a positive side-effect of how this feature has been implemented (by parsing f-strings with :pep:`the PEG parser <617>`), now error messages for f-strings are more precise and include the exact location of the error. For example, in Python 3.11, the following f-string raises a :exc:`SyntaxError`:
it_it: Come effetto collaterale positivo di come questa funzione è stata implementata (parsing delle f-string con :pep:`il PEG parser <617>`), ora i messaggi di errore per le f-string sono più precisi e includono l'esatta posizione dell'errore. Ad esempio, in Python 3.11, la seguente f-string genera un'eccezione :exc:`SyntaxError`:

source: but the error message doesn't include the exact location of the error within the line and also has the expression artificially surrounded by parentheses. In Python 3.12, as f-strings are parsed with the PEG parser, error messages can be more precise and show the entire line:
it_it: ma il messaggio di errore non include l'esatta posizione dell'errore all'interno della riga e ha anche l'espressione circondata artificialmente da parentesi. In Python 3.12, poiché le f-string sono parse con il PEG parser, i messaggi di errore possono essere più precisi e mostrare l'intera riga:

source: (Contributed by Pablo Galindo, Batuhan Taskaya, Lysandros Nikolaou, Cristián Maureira-Fredes and Marta Gómez in :gh:`102856`. PEP written by Pablo Galindo, Batuhan Taskaya, Lysandros Nikolaou and Marta Gómez).
it_it: (Contributi da Pablo Galindo, Batuhan Taskaya, Lysandros Nikolaou, Cristián Maureira-Fredes e Marta Gómez in :gh:`102856`. PEP scritto da Pablo Galindo, Batuhan Taskaya, Lysandros Nikolaou e Marta Gómez).

source: PEP 684: A Per-Interpreter GIL
it_it: PEP 684: Un GIL per interprete

source: :pep:`684` introduces a per-interpreter :term:`GIL <global interpreter lock>`, so that sub-interpreters may now be created with a unique GIL per interpreter. This allows Python programs to take full advantage of multiple CPU cores. This is currently only available through the C-API, though a Python API is :pep:`anticipated for 3.13 <554>`.
it_it: :pep:`684` introduce un :term:`GIL <global interpreter lock>` per interprete, in modo che gli interpreti secondari possano ora essere creati con un GIL unico per interprete. Questo consente ai programmi Python di sfruttare appieno i core della CPU multipli. Attualmente è disponibile solo tramite la C-API, sebbene si :pep:`preveda una API Python per la versione 3.13 <554>`.

source: Use the new :c:func:`Py_NewInterpreterFromConfig` function to create an interpreter with its own GIL:
it_it: Usa la nuova funzione :c:func:`Py_NewInterpreterFromConfig` per creare un interprete con il proprio GIL:

source: For further examples how to use the C-API for sub-interpreters with a per-interpreter GIL, see :source:`Modules/_xxsubinterpretersmodule.c`.
it_it: Per ulteriori esempi su come utilizzare la C-API per interpreti secondari con un GIL per interprete, vedi :source:`Modules/_xxsubinterpretersmodule.c`.

source: (Contributed by Eric Snow in :gh:`104210`, etc.)
it_it: (Contributi da Eric Snow in :gh:`104210`, ecc.)

source: PEP 669: Low impact monitoring for CPython
it_it: PEP 669: Monitoraggio a basso impatto per CPython

source: :pep:`669` defines a new :mod:`API <sys.monitoring>` for profilers, debuggers, and other tools to monitor events in CPython. It covers a wide range of events, including calls, returns, lines, exceptions, jumps, and more. This means that you only pay for what you use, providing support for near-zero overhead debuggers and coverage tools. See :mod:`sys.monitoring` for details.
it_it: :pep:`669` definisce una nuova :mod:`API <sys.monitoring>` per profiler, debugger e altri strumenti per monitorare eventi in CPython. Copre una vasta gamma di eventi, inclusi chiamate, ritorni, righe, eccezioni, salti e altro. Questo significa che paghi solo per quello che usi, fornendo supporto per strumenti di debug e copertura a quasi zero overhead. Vedi :mod:`sys.monitoring` per i dettagli.

source: (Contributed by Mark Shannon in :gh:`103082`.)
it_it: (Contributi da Mark Shannon in :gh:`103082`.)
