Repository: python/python-docs-it
Catalog: whatsnew/3.12.po
Languages: it_it

source: :c:var:`Py_DontWriteBytecodeFlag`: use :c:member:`PyConfig.write_bytecode`
it_it: :c:var:`Py_DontWriteBytecodeFlag`: usa :c:member:`PyConfig.write_bytecode`

source: :c:var:`Py_NoUserSiteDirectory`: use :c:member:`PyConfig.user_site_directory`
it_it: :c:var:`Py_NoUserSiteDirectory`: usa :c:member:`PyConfig.user_site_directory`

source: :c:var:`Py_UnbufferedStdioFlag`: use :c:member:`PyConfig.buffered_stdio`
it_it: :c:var:`Py_UnbufferedStdioFlag`: usa :c:member:`PyConfig.buffered_stdio`

source: :c:var:`Py_HashRandomizationFlag`: use :c:member:`PyConfig.use_hash_seed` and :c:member:`PyConfig.hash_seed`
it_it: :c:var:`Py_HashRandomizationFlag`: usa :c:member:`PyConfig.use_hash_seed` e :c:member:`PyConfig.hash_seed`

source: :c:var:`Py_IsolatedFlag`: use :c:member:`PyConfig.isolated`
it_it: :c:var:`Py_IsolatedFlag`: usa :c:member:`PyConfig.isolated`

source: :c:var:`Py_LegacyWindowsFSEncodingFlag`: use :c:member:`PyPreConfig.legacy_windows_fs_encoding`
it_it: :c:var:`Py_LegacyWindowsFSEncodingFlag`: usa :c:member:`PyPreConfig.legacy_windows_fs_encoding`

source: :c:var:`Py_LegacyWindowsStdioFlag`: use :c:member:`PyConfig.legacy_windows_stdio`
it_it: :c:var:`Py_LegacyWindowsStdioFlag`: usa :c:member:`PyConfig.legacy_windows_stdio`

source: :c:var:`!Py_FileSystemDefaultEncoding`: use :c:member:`PyConfig.filesystem_encoding`
it_it: :c:var:`!Py_FileSystemDefaultEncoding`: usa :c:member:`PyConfig.filesystem_encoding`

source: :c:var:`!Py_HasFileSystemDefaultEncoding`: use :c:member:`PyConfig.filesystem_encoding`
it_it: :c:var:`!Py_HasFileSystemDefaultEncoding`: usa :c:member:`PyConfig.filesystem_encoding`

source: :c:var:`!Py_FileSystemDefaultEncodeErrors`: use :c:member:`PyConfig.filesystem_errors`
it_it: :c:var:`!Py_FileSystemDefaultEncodeErrors`: usa :c:member:`PyConfig.filesystem_errors`

source: :c:var:`!Py_UTF8Mode`: use :c:member:`PyPreConfig.utf8_mode` (see :c:func:`Py_PreInitialize`)
it_it: :c:var:`!Py_UTF8Mode`: usa :c:member:`PyPreConfig.utf8_mode` (vedi :c:func:`Py_PreInitialize`)

source: The :c:func:`Py_InitializeFromConfig` API should be used with :c:type:`PyConfig` instead. (Contributed by Victor Stinner in :gh:`77782`.)
it_it: L'API :c:func:`Py_InitializeFromConfig` dovrebbe essere usata con :c:type:`PyConfig` invece. (Contribuito da Victor Stinner in :gh:`77782`.)

source: Creating :c:data:`immutable types <Py_TPFLAGS_IMMUTABLETYPE>` with mutable bases is deprecated and will be disabled in Python 3.14. (:gh:`95388`)
it_it: Creare :c:data:`tipi immutabili <Py_TPFLAGS_IMMUTABLETYPE>` con basi mutabili è deprecato e verrà disabilitato in Python 3.14. (:gh:`95388`)

source: The :file:`structmember.h` header is deprecated, though it continues to be available and there are no plans to remove it.
it_it: L'intestazione :file:`structmember.h` è deprecata, sebbene continui a essere disponibile e non ci siano piani per rimuoverla.

source: Its contents are now available just by including :file:`Python.h`, with a ``Py`` prefix added if it was missing:
it_it: I suoi contenuti sono ora disponibili semplicemente includendo :file:`Python.h`, con un prefisso ``Py`` aggiunto se mancava:

source: :c:struct:`PyMemberDef`, :c:func:`PyMember_GetOne` and :c:func:`PyMember_SetOne`
it_it: :c:struct:`PyMemberDef`, :c:func:`PyMember_GetOne` e :c:func:`PyMember_SetOne`

source: Type macros like :c:macro:`Py_T_INT`, :c:macro:`Py_T_DOUBLE`, etc. (previously ``T_INT``, ``T_DOUBLE``, etc.)
it_it: Macro di tipo come :c:macro:`Py_T_INT`, :c:macro:`Py_T_DOUBLE`, ecc. (precedentemente ``T_INT``, ``T_DOUBLE``, ecc.)

source: The flags :c:macro:`Py_READONLY` (previously ``READONLY``) and :c:macro:`Py_AUDIT_READ` (previously all uppercase)
it_it: Le bandiere :c:macro:`Py_READONLY` (precedentemente ``READONLY``) e :c:macro:`Py_AUDIT_READ` (precedentemente tutte maiuscole)

source: Several items are not exposed from :file:`Python.h`:
it_it: Diversi elementi non sono esposti da :file:`Python.h`:

source: :c:macro:`T_OBJECT` (use :c:macro:`Py_T_OBJECT_EX`)
it_it: :c:macro:`T_OBJECT` (usa :c:macro:`Py_T_OBJECT_EX`)

source: :c:macro:`T_NONE` (previously undocumented, and pretty quirky)
it_it: :c:macro:`T_NONE` (precedentemente non documentato, e piuttosto strano)

source: The macro ``WRITE_RESTRICTED`` which does nothing.
it_it: La macro ``WRITE_RESTRICTED`` che non fa nulla.

source: The macros ``RESTRICTED`` and ``READ_RESTRICTED``, equivalents of :c:macro:`Py_AUDIT_READ`.
it_it: Le macro ``RESTRICTED`` e ``READ_RESTRICTED``, equivalenti di :c:macro:`Py_AUDIT_READ`.

source: In some configurations, ``<stddef.h>`` is not included from :file:`Python.h`. It should be included manually when using ``offsetof()``.
it_it: In alcune configurazioni, ``<stddef.h>`` non è incluso da :file:`Python.h`. Va incluso manualmente quando si utilizza ``offsetof()``.

source: The deprecated header continues to provide its original contents under the original names. Your old code can stay unchanged, unless the extra include and non-namespaced macros bother you greatly.
it_it: L'header deprecato continua a fornire i suoi contenuti originali sotto i nomi originali. Il tuo vecchio codice può rimanere invariato, a meno che l'inclusione extra e le macro non spaziati ti diano molto fastidio.

source: (Contributed in :gh:`47146` by Petr Viktorin, based on earlier work by Alexander Belopolsky and Matthias Braun.)
it_it: (Contribuito in :gh:`47146` da Petr Viktorin, basato su lavori precedenti di Alexander Belopolsky e Matthias Braun.)

source: :c:func:`PyErr_Fetch` and :c:func:`PyErr_Restore` are deprecated. Use :c:func:`PyErr_GetRaisedException` and :c:func:`PyErr_SetRaisedException` instead. (Contributed by Mark Shannon in :gh:`101578`.)
it_it: :c:func:`PyErr_Fetch` e :c:func:`PyErr_Restore` sono deprecate. Usa :c:func:`PyErr_GetRaisedException` e :c:func:`PyErr_SetRaisedException` invece. (Contribuito da Mark Shannon in :gh:`101578`.)

source: :c:func:`!PyErr_Display` is deprecated. Use :c:func:`PyErr_DisplayException` instead. (Contributed by Irit Katriel in :gh:`102755`).
it_it: :c:func:`!PyErr_Display` è deprecata. Usa :c:func:`PyErr_DisplayException` invece. (Contribuito da Irit Katriel in :gh:`102755`).

source: ``_PyErr_ChainExceptions`` is deprecated. Use ``_PyErr_ChainExceptions1`` instead. (Contributed by Irit Katriel in :gh:`102192`.)
it_it: ``_PyErr_ChainExceptions`` è deprecata. Usa ``_PyErr_ChainExceptions1`` invece. (Contribuito da Irit Katriel in :gh:`102192`.)

source: Using :c:func:`PyType_FromSpec`, :c:func:`PyType_FromSpecWithBases` or :c:func:`PyType_FromModuleAndSpec` to create a class whose metaclass overrides :c:member:`~PyTypeObject.tp_new` is deprecated. Call the metaclass instead.
it_it: Usare :c:func:`PyType_FromSpec`, :c:func:`PyType_FromSpecWithBases` o :c:func:`PyType_FromModuleAndSpec` per creare una classe la cui metaclasse sovrascrive :c:member:`~PyTypeObject.tp_new` è deprecato. Chiama direttamente la metaclasse invece.

source: The ``ma_version_tag`` field in :c:type:`PyDictObject` for extension modules (:pep:`699`; :gh:`101193`).
it_it: Il campo ``ma_version_tag`` in :c:type:`PyDictObject` per moduli di estensione (:pep:`699`; :gh:`101193`).

source: Global configuration variables:
it_it: Variabili di configurazione globali:

source: The :c:func:`Py_InitializeFromConfig` API should be used with :c:type:`PyConfig` instead.
it_it: L'API :c:func:`Py_InitializeFromConfig` dovrebbe essere usata con :c:type:`PyConfig`.

source: Creating :c:data:`immutable types <Py_TPFLAGS_IMMUTABLETYPE>` with mutable bases (:gh:`95388`).
it_it: Creare :c:data:`tipi immutabili <Py_TPFLAGS_IMMUTABLETYPE>` con basi mutabili (:gh:`95388`).

source: :c:func:`PyImport_ImportModuleNoBlock`: use :c:func:`PyImport_ImportModule`
it_it: :c:func:`PyImport_ImportModuleNoBlock`: usa :c:func:`PyImport_ImportModule`

source: :c:type:`!Py_UNICODE_WIDE` type: use :c:type:`wchar_t`
it_it: Tipo :c:type:`!Py_UNICODE_WIDE`: usa :c:type:`wchar_t`

source: :c:type:`Py_UNICODE` type: use :c:type:`wchar_t`
it_it: Tipo :c:type:`Py_UNICODE`: usa :c:type:`wchar_t`

source: Python initialization functions:
it_it: Funzioni di inizializzazione di Python:

source: :c:func:`PySys_ResetWarnOptions`: clear :data:`sys.warnoptions` and :data:`!warnings.filters`
it_it: :c:func:`PySys_ResetWarnOptions`: pulisce :data:`sys.warnoptions` e :data:`!warnings.filters`

source: :c:func:`Py_GetExecPrefix`: get :data:`sys.exec_prefix`
it_it: :c:func:`Py_GetExecPrefix`: ottiene :data:`sys.exec_prefix`

source: :c:func:`Py_GetPath`: get :data:`sys.path`
it_it: :c:func:`Py_GetPath`: ottiene :data:`sys.path`

source: :c:func:`Py_GetPrefix`: get :data:`sys.prefix`
it_it: :c:func:`Py_GetPrefix`: ottiene :data:`sys.prefix`

source: :c:func:`Py_GetProgramFullPath`: get :data:`sys.executable`
it_it: :c:func:`Py_GetProgramFullPath`: ottiene :data:`sys.executable`

source: :c:func:`Py_GetProgramName`: get :data:`sys.executable`
it_it: :c:func:`Py_GetProgramName`: ottiene :data:`sys.executable`

source: :c:func:`Py_GetPythonHome`: get :c:member:`PyConfig.home` or the :envvar:`PYTHONHOME` environment variable
it_it: :c:func:`Py_GetPythonHome`: ottiene :c:member:`PyConfig.home` o la variabile d'ambiente :envvar:`PYTHONHOME`

source: The following APIs are deprecated and will be removed, although there is currently no date scheduled for their removal.
it_it: Le seguenti API sono deprecate e verranno rimosse, anche se attualmente non è prevista una data di rimozione.

source: :c:macro:`Py_TPFLAGS_HAVE_FINALIZE`: unneeded since Python 3.8
it_it: :c:macro:`Py_TPFLAGS_HAVE_FINALIZE`: non necessaria da Python 3.8

source: :c:func:`PyErr_Fetch`: use :c:func:`PyErr_GetRaisedException`
it_it: :c:func:`PyErr_Fetch`: usa :c:func:`PyErr_GetRaisedException`

source: :c:func:`PyErr_NormalizeException`: use :c:func:`PyErr_GetRaisedException`
it_it: :c:func:`PyErr_NormalizeException`: usa :c:func:`PyErr_GetRaisedException`

source: :c:func:`PyErr_Restore`: use :c:func:`PyErr_SetRaisedException`
it_it: :c:func:`PyErr_Restore`: usa :c:func:`PyErr_SetRaisedException`

source: :c:func:`PyModule_GetFilename`: use :c:func:`PyModule_GetFilenameObject`
it_it: :c:func:`PyModule_GetFilename`: usa :c:func:`PyModule_GetFilenameObject`

source: :c:func:`PyOS_AfterFork`: use :c:func:`PyOS_AfterFork_Child`
it_it: :c:func:`PyOS_AfterFork`: usa :c:func:`PyOS_AfterFork_Child`

source: :c:func:`PySlice_GetIndicesEx`: use :c:func:`PySlice_Unpack` and :c:func:`PySlice_AdjustIndices`
it_it: :c:func:`PySlice_GetIndicesEx`: usa :c:func:`PySlice_Unpack` e :c:func:`PySlice_AdjustIndices`

source: :c:func:`!PyUnicode_AsDecodedObject`: use :c:func:`PyCodec_Decode`
it_it: :c:func:`!PyUnicode_AsDecodedObject`: usa :c:func:`PyCodec_Decode`

source: :c:func:`!PyUnicode_AsDecodedUnicode`: use :c:func:`PyCodec_Decode`
it_it: :c:func:`!PyUnicode_AsDecodedUnicode`: usa :c:func:`PyCodec_Decode`

source: :c:func:`!PyUnicode_AsEncodedObject`: use :c:func:`PyCodec_Encode`
it_it: :c:func:`!PyUnicode_AsEncodedObject`: usa :c:func:`PyCodec_Encode`

source: :c:func:`!PyUnicode_AsEncodedUnicode`: use :c:func:`PyCodec_Encode`
it_it: :c:func:`!PyUnicode_AsEncodedUnicode`: usa :c:func:`PyCodec_Encode`

source: :c:func:`PyUnicode_READY`: unneeded since Python 3.12
it_it: :c:func:`PyUnicode_READY`: non necessaria da Python 3.12

source: :c:func:`!PyErr_Display`: use :c:func:`PyErr_DisplayException`
it_it: :c:func:`!PyErr_Display`: usa :c:func:`PyErr_DisplayException`

source: :c:func:`!_PyErr_ChainExceptions`: use ``_PyErr_ChainExceptions1``
it_it: :c:func:`!_PyErr_ChainExceptions`: usa ``_PyErr_ChainExceptions1``

source: :c:member:`!PyBytesObject.ob_shash` member: call :c:func:`PyObject_Hash` instead
it_it: :c:member:`!PyBytesObject.ob_shash` member: chiama :c:func:`PyObject_Hash` invece

source: Thread Local Storage (TLS) API:
it_it: API del Thread Local Storage (TLS):

source: :c:func:`PyThread_create_key`: use :c:func:`PyThread_tss_alloc`
it_it: :c:func:`PyThread_create_key`: usa :c:func:`PyThread_tss_alloc`

source: :c:func:`PyThread_delete_key`: use :c:func:`PyThread_tss_free`
it_it: :c:func:`PyThread_delete_key`: usa :c:func:`PyThread_tss_free`

source: :c:func:`PyThread_set_key_value`: use :c:func:`PyThread_tss_set`
it_it: :c:func:`PyThread_set_key_value`: usa :c:func:`PyThread_tss_set`

source: :c:func:`PyThread_get_key_value`: use :c:func:`PyThread_tss_get`
it_it: :c:func:`PyThread_get_key_value`: usa :c:func:`PyThread_tss_get`

source: :c:func:`PyThread_delete_key_value`: use :c:func:`PyThread_tss_delete`
it_it: :c:func:`PyThread_delete_key_value`: usa :c:func:`PyThread_tss_delete`

source: :c:func:`PyThread_ReInitTLS`: unneeded since Python 3.7
it_it: :c:func:`PyThread_ReInitTLS`: non necessaria da Python 3.7

source: Remove the :file:`token.h` header file. There was never any public tokenizer C API. The :file:`token.h` header file was only designed to be used by Python internals. (Contributed by Victor Stinner in :gh:`92651`.)
it_it: Rimuovi il file di intestazione :file:`token.h`. Non c'è mai stata un'API pubblica per il tokenizer C. Il file di intestazione :file:`token.h` è stato progettato solo per essere usato dagli interni di Python. (Contribuito da Victor Stinner in :gh:`92651`.)

source: Legacy Unicode APIs have been removed. See :pep:`623` for detail.
it_it: Le API Unicode legacy sono state rimosse. Vedi :pep:`623` per i dettagli.

source: Remove the ``PyUnicode_InternImmortal()`` function macro. (Contributed by Victor Stinner in :gh:`85858`.)
it_it: Rimuovi la macro della funzione ``PyUnicode_InternImmortal()``. (Contributo di Victor Stinner in :gh:`85858`.)

source: Notable changes in 3.12.4
it_it: Cambiamenti notevoli in 3.12.4

source: Fixed ``is_global`` and ``is_private`` behavior in ``IPv4Address``, ``IPv6Address``, ``IPv4Network`` and ``IPv6Network``.
it_it: Risolto il comportamento di ``is_global`` e ``is_private`` in ``IPv4Address``, ``IPv6Address``, ``IPv4Network`` e ``IPv6Network``.
