Repository: python/python-docs-it
Catalog: whatsnew/3.12.po
Languages: it_it

source: :class:`typing.ByteString`, deprecated since Python 3.9, now causes a :exc:`DeprecationWarning` to be emitted when it is used. (Contributed by Alex Waygood in :gh:`91896`.)
it_it: :class:`typing.ByteString`, deprecata da Python 3.9, ora genera un :exc:`DeprecationWarning` quando viene utilizzata. (Contributo di Alex Waygood in :gh:`91896`.)

source: :mod:`xml.etree.ElementTree`: The module now emits :exc:`DeprecationWarning` when testing the truth value of an :class:`xml.etree.ElementTree.Element`. Before, the Python implementation emitted :exc:`FutureWarning`, and the C implementation emitted nothing. (Contributed by Jacob Walls in :gh:`83122`.)
it_it: :mod:`xml.etree.ElementTree`: Il modulo ora emette :exc:`DeprecationWarning` quando si testa il valore di verità di un :class:`xml.etree.ElementTree.Element`. Prima, l'implementazione in Python emetteva :exc:`FutureWarning`, e l'implementazione in C non emetteva nulla. (Contributo di Jacob Walls in :gh:`83122`.)

source: The 3-arg signatures (type, value, traceback) of :meth:`coroutine throw() <coroutine.throw>`, :meth:`generator throw() <generator.throw>` and :meth:`async generator throw() <agen.athrow>` are deprecated and may be removed in a future version of Python. Use the single-arg versions of these functions instead. (Contributed by Ofey Chan in :gh:`89874`.)
it_it: Le firme a 3 argomenti (type, value, traceback) di :meth:`coroutine throw() <coroutine.throw>`, :meth:`generator throw() <generator.throw>` e :meth:`async generator throw() <agen.athrow>` sono deprecate e potrebbero essere rimosse in una futura versione di Python. Utilizzare invece le versioni a un singolo argomento di queste funzioni. (Contributo di Ofey Chan in :gh:`89874`.)

source: :exc:`DeprecationWarning` is now raised when ``__package__`` on a module differs from ``__spec__.parent`` (previously it was :exc:`ImportWarning`). (Contributed by Brett Cannon in :gh:`65961`.)
it_it: Ora viene generato un :exc:`DeprecationWarning` quando ``__package__`` in un modulo differisce da ``__spec__.parent`` (in precedenza era :exc:`ImportWarning`). (Contributo di Brett Cannon in :gh:`65961`.)

source: Setting ``__package__`` or ``__cached__`` on a module is deprecated, and will cease to be set or taken into consideration by the import system in Python 3.14. (Contributed by Brett Cannon in :gh:`65961`.)
it_it: Impostare ``__package__`` o ``__cached__`` in un modulo è deprecato, e smetterà di essere impostato o considerato dall'import system in Python 3.14. (Contributo di Brett Cannon in :gh:`65961`.)

source: The bitwise inversion operator (``~``) on bool is deprecated. It will throw an error in Python 3.14. Use ``not`` for logical negation of bools instead. In the rare case that you really need the bitwise inversion of the underlying ``int``, convert to int explicitly: ``~int(x)``. (Contributed by Tim Hoffmann in :gh:`103487`.)
it_it: L'operatore di inversione bit a bit (``~``) su bool è deprecato. Genererà un errore in Python 3.14. Utilizzare ``not`` per la negazione logica dei bools invece. Nel raro caso in cui sia davvero necessario l'inversione bit a bit dell'``int`` sottostante, convertire esplicitamente in int: ``~int(x)``. (Contributo di Tim Hoffmann in :gh:`103487`.)

source: Accessing :attr:`~codeobject.co_lnotab` on code objects was deprecated in Python 3.10 via :pep:`626`, but it only got a proper :exc:`DeprecationWarning` in 3.12, therefore it will be removed in 3.14. (Contributed by Nikita Sobolev in :gh:`101866`.)
it_it: Accedere a :attr:`~codeobject.co_lnotab` sugli oggetti codice è deprecato in Python 3.10 tramite :pep:`626`, ma ha ottenuto un vero e proprio :exc:`DeprecationWarning` solo in 3.12, quindi sarà rimosso in 3.14. (Contributo di Nikita Sobolev in :gh:`101866`.)

source: Pending Removal in Python 3.13
it_it: Rimozione pianificata in Python 3.13

source: The following modules and APIs have been deprecated in earlier Python releases, and will be removed in Python 3.13.
it_it: I seguenti moduli e API sono stati deprecati in versioni precedenti di Python e saranno rimossi in Python 3.13.

source: Modules (see :pep:`594`):
it_it: Moduli (vedi :pep:`594`):

source: Other modules:
it_it: Altri moduli:

source: :mod:`!lib2to3`, and the :program:`2to3` program (:gh:`84540`)
it_it: :mod:`!lib2to3`, e il programma :program:`2to3` (:gh:`84540`)

source: APIs:
it_it: API:

source: :class:`classmethod` descriptor chaining (:gh:`89519`)
it_it: Catena di descrittori :class:`classmethod` (:gh:`89519`)

source: :mod:`importlib.resources` deprecated methods:
it_it: metodi deprecati :mod:`importlib.resources`:

source: Use :func:`importlib.resources.files()` instead. Refer to `importlib-resources: Migrating from Legacy <https://importlib-resources.readthedocs.io/en/latest/using.html#migrating-from-legacy>`_ (:gh:`106531`)
it_it: Usa :func:`importlib.resources.files()` al suo posto. Consulta `importlib-resources: Migrating from Legacy <https://importlib-resources.readthedocs.io/en/latest/using.html#migrating-from-legacy>`_ (:gh:`106531`)

source: Pending Removal in Python 3.14
it_it: Rimozione prevista in Python 3.14

source: The following APIs have been deprecated and will be removed in Python 3.14.
it_it: Le seguenti API sono state deprecate e verranno rimosse in Python 3.14.

source: :mod:`argparse`: The *type*, *choices*, and *metavar* parameters of :class:`!argparse.BooleanOptionalAction`
it_it: :mod:`argparse`: i parametri *type*, *choices*, e *metavar* di :class:`!argparse.BooleanOptionalAction`

source: :mod:`email`: the *isdst* parameter in :func:`email.utils.localtime`.
it_it: :mod:`email`: il parametro *isdst* in :func:`email.utils.localtime`.

source: :mod:`itertools`: Support for copy, deepcopy, and pickle operations.
it_it: :mod:`itertools`: Supporto per operazioni di copia, deepcopy e pickle.

source: :mod:`shutil`: The *onerror* argument of :func:`shutil.rmtree`
it_it: :mod:`shutil`: L'argomento *onerror* di :func:`shutil.rmtree`

source: :mod:`xml.etree.ElementTree`: Testing the truth value of an :class:`xml.etree.ElementTree.Element`.
it_it: :mod:`xml.etree.ElementTree`: Verifica del valore di verità di un :class:`xml.etree.ElementTree.Element`.

source: The ``__package__`` and ``__cached__`` attributes on module objects.
it_it: Gli attributi ``__package__`` e ``__cached__`` sugli oggetti modulo.

source: The :attr:`~codeobject.co_lnotab` attribute of code objects.
it_it: L'attributo :attr:`~codeobject.co_lnotab` degli oggetti codice.

source: Pending Removal in Python 3.15
it_it: Rimozione in sospeso in Python 3.15

source: The following APIs have been deprecated and will be removed in Python 3.15.
it_it: Le seguenti API sono state deprecate e saranno rimosse in Python 3.15.

source: Pending Removal in Future Versions
it_it: Rimozione in sospeso nelle versioni future

source: The following APIs were deprecated in earlier Python versions and will be removed, although there is currently no date scheduled for their removal.
it_it: Le seguenti API sono state deprecate nelle versioni precedenti di Python e saranno rimosse, anche se al momento non è prevista una data per la loro rimozione.

source: :mod:`array`'s ``'u'`` format code (:gh:`57281`)
it_it: Il codice di formato ``'u'`` di :mod:`array` (:gh:`57281`)

source: Currently Python accepts numeric literals immediately followed by keywords, for example ``0in x``, ``1or x``, ``0if 1else 2``. It allows confusing and ambiguous expressions like ``[0x1for x in y]`` (which can be interpreted as ``[0x1 for x in y]`` or ``[0x1f or x in y]``). A syntax warning is raised if the numeric literal is immediately followed by one of keywords :keyword:`and`, :keyword:`else`, :keyword:`for`, :keyword:`if`, :keyword:`in`, :keyword:`is` and :keyword:`or`. In a future release it will be changed to a syntax error. (:gh:`87999`)
it_it: Attualmente Python accetta letterali numerici seguiti immediatamente da parole chiave, ad esempio ``0in x``, ``1or x``, ``0if 1else 2``. Permette espressioni confuse e ambigue come ``[0x1for x in y]`` (che può essere interpretato come ``[0x1 for x in y]`` o ``[0x1f or x in y]``). Viene generato un avviso di sintassi se il letterale numerico è seguito immediatamente da una delle parole chiave :keyword:`and`, :keyword:`else`, :keyword:`for`, :keyword:`if`, :keyword:`in`, :keyword:`is` e :keyword:`or`. In una versione futura verrà modificato in un errore di sintassi. (:gh:`87999`)

source: Removed
it_it: Rimosso

source: asynchat and asyncore
it_it: asynchat e asyncore

source: These two modules have been removed according to the schedule in :pep:`594`, having been deprecated in Python 3.6. Use :mod:`asyncio` instead. (Contributed by Nikita Sobolev in :gh:`96580`.)
it_it: Questi due moduli sono stati rimossi secondo il programma in :pep:`594`, essendo stati deprecati in Python 3.6. Utilizzare :mod:`asyncio` invece. (Contribuito da Nikita Sobolev in :gh:`96580`.)

source: Several names deprecated in the :mod:`configparser` way back in 3.2 have been removed per :gh:`89336`:
it_it: Diversi nomi deprecati nel :mod:`configparser` fin dalla versione 3.2 sono stati rimossi per :gh:`89336`:

source: :class:`configparser.ParsingError` no longer has a ``filename`` attribute or argument. Use the ``source`` attribute and argument instead.
it_it: :class:`configparser.ParsingError` non ha più un attributo o argomento ``filename``. Utilizzare al suo posto l'attributo e l'argomento ``source``.

source: :mod:`configparser` no longer has a ``SafeConfigParser`` class. Use the shorter :class:`~configparser.ConfigParser` name instead.
it_it: :mod:`configparser` non ha più una classe ``SafeConfigParser``. Utilizzare al suo posto il nome più breve :class:`~configparser.ConfigParser`.

source: :class:`configparser.ConfigParser` no longer has a ``readfp`` method. Use :meth:`~configparser.ConfigParser.read_file` instead.
it_it: :class:`configparser.ConfigParser` non ha più un metodo ``readfp``. Utilizzare al suo posto :meth:`~configparser.ConfigParser.read_file`.

source: Remove the :py:mod:`!distutils` package. It was deprecated in Python 3.10 by :pep:`632` "Deprecate distutils module". For projects still using ``distutils`` and cannot be updated to something else, the ``setuptools`` project can be installed: it still provides ``distutils``. (Contributed by Victor Stinner in :gh:`92584`.)
it_it: Rimozione del pacchetto :py:mod:`!distutils`. È stato deprecato in Python 3.10 da :pep:`632` "Deprecazione del modulo distutils". Per i progetti che ancora utilizzano ``distutils`` e non possono essere aggiornati ad altro, il progetto ``setuptools`` può essere installato: fornisce ancora ``distutils``. (Contribuito da Victor Stinner in :gh:`92584`.)

source: Remove the bundled setuptools wheel from :mod:`ensurepip`, and stop installing setuptools in environments created by :mod:`venv`.
it_it: Rimozione della ruota setuptools inclusa in :mod:`ensurepip`, e cessazione dell'installazione di setuptools negli ambienti creati da :mod:`venv`.

source: ``pip (>= 22.1)`` does not require setuptools to be installed in the environment. ``setuptools``-based (and ``distutils``-based) packages can still be used with ``pip install``, since pip will provide ``setuptools`` in the build environment it uses for building a package.
it_it: ``pip (>= 22.1)`` non richiede che setuptools sia installato nell'ambiente. I pacchetti basati su ``setuptools`` (e su ``distutils``) possono ancora essere utilizzati con ``pip install``, poiché pip fornirà ``setuptools`` nell'ambiente di build che utilizza per costruire un pacchetto.

source: ``easy_install``, ``pkg_resources``, ``setuptools`` and ``distutils`` are no longer provided by default in environments created with ``venv`` or bootstrapped with ``ensurepip``, since they are part of the ``setuptools`` package. For projects relying on these at runtime, the ``setuptools`` project should be declared as a dependency and installed separately (typically, using pip).
it_it: ``easy_install``, ``pkg_resources``, ``setuptools`` e ``distutils`` non sono più forniti di default negli ambienti creati con ``venv`` o bootstrap con ``ensurepip``, poiché fanno parte del pacchetto ``setuptools``. Per i progetti che dipendono da questi a runtime, il progetto ``setuptools`` dovrebbe essere dichiarato come una dipendenza e installato separatamente (tipicamente, utilizzando pip).

source: (Contributed by Pradyun Gedam in :gh:`95299`.)
it_it: (Contribuito da Pradyun Gedam in :gh:`95299`.)

source: Remove :mod:`enum`'s ``EnumMeta.__getattr__``, which is no longer needed for enum attribute access. (Contributed by Ethan Furman in :gh:`95083`.)
it_it: Rimozione di ``EnumMeta.__getattr__`` di :mod:`enum`, che non è più necessario per l'accesso agli attributi degli enum. (Contribuito da Ethan Furman in :gh:`95083`.)

source: Remove :mod:`ftplib`'s ``FTP_TLS.ssl_version`` class attribute: use the *context* parameter instead. (Contributed by Victor Stinner in :gh:`94172`.)
it_it: Rimozione dell'attributo di classe ``FTP_TLS.ssl_version`` di :mod:`ftplib`: utilizzare invece il parametro *context*. (Contribuito da Victor Stinner in :gh:`94172`.)

source: Remove the ``filename`` attribute of :mod:`gzip`'s :class:`gzip.GzipFile`, deprecated since Python 2.6, use the :attr:`~gzip.GzipFile.name` attribute instead. In write mode, the ``filename`` attribute added ``'.gz'`` file extension if it was not present. (Contributed by Victor Stinner in :gh:`94196`.)
it_it: Rimozione dell'attributo ``filename`` di :class:`gzip.GzipFile` di :mod:`gzip`, deprecato dalla versione Python 2.6, utilizzare invece l'attributo :attr:`~gzip.GzipFile.name`. In modalità scrittura, l'attributo ``filename`` aggiungeva l'estensione di file ``'.gz'`` se non era presente. (Contribuito da Victor Stinner in :gh:`94196`.)

source: Remove the pure Python implementation of :mod:`hashlib`'s :func:`hashlib.pbkdf2_hmac()`, deprecated in Python 3.10. Python 3.10 and newer requires OpenSSL 1.1.1 (:pep:`644`): this OpenSSL version provides a C implementation of :func:`~hashlib.pbkdf2_hmac()` which is faster. (Contributed by Victor Stinner in :gh:`94199`.)
it_it: Rimozione dell'implementazione pura in Python di :func:`hashlib.pbkdf2_hmac()` di :mod:`hashlib`, deprecato in Python 3.10. Python 3.10 e versioni successive richiedono OpenSSL 1.1.1 (:pep:`644`): questa versione di OpenSSL fornisce una implementazione in C di :func:`~hashlib.pbkdf2_hmac()` che è più veloce. (Contribuito da Victor Stinner in :gh:`94199`.)

source: Many previously deprecated cleanups in :mod:`importlib` have now been completed:
it_it: Molti di precedenti deprecazioni in :mod:`importlib` sono ora state completate:

source: References to, and support for :meth:`!module_repr()` has been removed. (Contributed by Barry Warsaw in :gh:`97850`.)
it_it: I riferimenti a, e il supporto per :meth:`!module_repr()` sono stati rimossi. (Contribuito da Barry Warsaw in :gh:`97850`.)

source: ``importlib.util.set_package``, ``importlib.util.set_loader`` and ``importlib.util.module_for_loader`` have all been removed. (Contributed by Brett Cannon and Nikita Sobolev in :gh:`65961` and :gh:`97850`.)
it_it: ``importlib.util.set_package``, ``importlib.util.set_loader`` e ``importlib.util.module_for_loader`` sono stati tutti rimossi. (Contribuito da Brett Cannon e Nikita Sobolev in :gh:`65961` e :gh:`97850`.)

source: Support for ``find_loader()`` and ``find_module()`` APIs have been removed. (Contributed by Barry Warsaw in :gh:`98040`.)
it_it: Il supporto per le API ``find_loader()`` e ``find_module()`` è stato rimosso. (Contribuito da Barry Warsaw in :gh:`98040`.)

source: ``importlib.abc.Finder``, ``pkgutil.ImpImporter``, and ``pkgutil.ImpLoader`` have been removed. (Contributed by Barry Warsaw in :gh:`98040`.)
it_it: ``importlib.abc.Finder``, ``pkgutil.ImpImporter`` e ``pkgutil.ImpLoader`` sono stati rimossi. (Contribuito da Barry Warsaw in :gh:`98040`.)

source: The :mod:`!imp` module has been removed. (Contributed by Barry Warsaw in :gh:`98040`.)
it_it: Il modulo :mod:`!imp` è stato rimosso. (Contribuito da Barry Warsaw in :gh:`98040`.)

source: To migrate, consult the following correspondence table:
it_it: Per migrare, consultare la seguente tabella di corrispondenza:

source: Insert ``None`` into ``sys.path_importer_cache``
it_it: Inserire ``None`` in ``sys.path_importer_cache``

source: :attr:`importlib.machinery.SOURCE_SUFFIXES`, :attr:`importlib.machinery.EXTENSION_SUFFIXES`, and :attr:`importlib.machinery.BYTECODE_SUFFIXES`
it_it: :attr:`importlib.machinery.SOURCE_SUFFIXES`, :attr:`importlib.machinery.EXTENSION_SUFFIXES`, e :attr:`importlib.machinery.BYTECODE_SUFFIXES`

source: *See below*
it_it: *Vedi sotto*

source: Replace ``imp.load_source()`` with::
it_it: Sostituire ``imp.load_source()`` con::

source: Remove :mod:`!imp` functions and attributes with no replacements:
it_it: Rimuovere le funzioni e gli attributi di :mod:`!imp` senza sostituzioni:

source: Undocumented functions:
it_it: Funzioni non documentate:

source: ``imp.lock_held()``, ``imp.acquire_lock()``, ``imp.release_lock()``: the locking scheme has changed in Python 3.3 to per-module locks.
it_it: ``imp.lock_held()``, ``imp.acquire_lock()``, ``imp.release_lock()``: lo schema di blocco è cambiato in Python 3.3 a blocchi per modulo.

source: ``imp.find_module()`` constants: ``SEARCH_ERROR``, ``PY_SOURCE``, ``PY_COMPILED``, ``C_EXTENSION``, ``PY_RESOURCE``, ``PKG_DIRECTORY``, ``C_BUILTIN``, ``PY_FROZEN``, ``PY_CODERESOURCE``, ``IMP_HOOK``.
it_it: Costanti di ``imp.find_module()``: ``SEARCH_ERROR``, ``PY_SOURCE``, ``PY_COMPILED``, ``C_EXTENSION``, ``PY_RESOURCE``, ``PKG_DIRECTORY``, ``C_BUILTIN``, ``PY_FROZEN``, ``PY_CODERESOURCE``, ``IMP_HOOK``.

source: Remove :mod:`io`'s ``io.OpenWrapper`` and ``_pyio.OpenWrapper``, deprecated in Python 3.10: just use :func:`open` instead. The :func:`open` (:func:`io.open`) function is a built-in function. Since Python 3.10, :func:`!_pyio.open` is also a static method. (Contributed by Victor Stinner in :gh:`94169`.)
it_it: Rimuovere ``io.OpenWrapper`` di :mod:`io` e ``_pyio.OpenWrapper``, deprecati in Python 3.10: utilizzare semplicemente :func:`open`. La funzione :func:`open` (:func:`io.open`) è una funzione integrata. Dalla versione 3.10 di Python, :func:`!_pyio.open` è anche un metodo statico. (Contributo di Victor Stinner in :gh:`94169`.)

source: Remove :mod:`locale`'s :func:`!locale.format` function, deprecated in Python 3.7: use :func:`locale.format_string` instead. (Contributed by Victor Stinner in :gh:`94226`.)
it_it: Rimuovere la funzione :func:`!locale.format` di :mod:`locale`, deprecata in Python 3.7: usare invece :func:`locale.format_string`. (Contributo di Victor Stinner in :gh:`94226`.)

source: The ``smtpd`` module has been removed according to the schedule in :pep:`594`, having been deprecated in Python 3.4.7 and 3.5.4. Use the :pypi:`aiosmtpd` PyPI module or any other :mod:`asyncio`-based server instead. (Contributed by Oleg Iarygin in :gh:`93243`.)
it_it: Il modulo ``smtpd`` è stato rimosso secondo il programma di :pep:`594`, essendo stato deprecato in Python 3.4.7 e 3.5.4. Utilizzare il modulo PyPI :pypi:`aiosmtpd` o qualsiasi altro server basato su :mod:`asyncio`. (Contributo di Oleg Iarygin in :gh:`93243`.)

source: The following undocumented :mod:`sqlite3` features, deprecated in Python 3.10, are now removed:
it_it: Le seguenti funzionalità non documentate di :mod:`sqlite3`, deprecate in Python 3.10, sono ora rimosse:

source: If a shared cache must be used, open the database in URI mode using the ``cache=shared`` query parameter.
it_it: Se è necessario utilizzare una cache condivisa, aprire il database in modalità URI utilizzando il parametro di query ``cache=shared``.

source: The ``sqlite3.OptimizedUnicode`` text factory has been an alias for :class:`str` since Python 3.3. Code that previously set the text factory to ``OptimizedUnicode`` can either use ``str`` explicitly, or rely on the default value which is also ``str``.
it_it: La text factory ``sqlite3.OptimizedUnicode`` è stata un alias per :class:`str` fin dalla versione 3.3 di Python. Il codice che precedentemente impostava la text factory su ``OptimizedUnicode`` può utilizzare esplicitamente ``str``, o affidarsi al valore predefinito che è anch'esso ``str``.

source: (Contributed by Erlend E. Aasland in :gh:`92548`.)
it_it: (Contributo di Erlend E. Aasland in :gh:`92548`.)

source: Remove :mod:`ssl`'s :func:`!ssl.RAND_pseudo_bytes` function, deprecated in Python 3.6: use :func:`os.urandom` or :func:`ssl.RAND_bytes` instead. (Contributed by Victor Stinner in :gh:`94199`.)
it_it: Rimuovere la funzione :func:`!ssl.RAND_pseudo_bytes` di :mod:`ssl`, deprecata in Python 3.6: utilizzare invece :func:`os.urandom` o :func:`ssl.RAND_bytes`. (Contributo di Victor Stinner in :gh:`94199`.)

source: Remove the :func:`!ssl.match_hostname` function. It was deprecated in Python 3.7. OpenSSL performs hostname matching since Python 3.7, Python no longer uses the :func:`!ssl.match_hostname` function. (Contributed by Victor Stinner in :gh:`94199`.)
it_it: Rimuovere la funzione :func:`!ssl.match_hostname`. È stata deprecata in Python 3.7. OpenSSL esegue il confronto degli hostname dalla versione 3.7 di Python, Python non utilizza più la funzione :func:`!ssl.match_hostname`. (Contributo di Victor Stinner in :gh:`94199`.)

source: Remove the :func:`!ssl.wrap_socket` function, deprecated in Python 3.7: instead, create a :class:`ssl.SSLContext` object and call its :class:`ssl.SSLContext.wrap_socket` method. Any package that still uses :func:`!ssl.wrap_socket` is broken and insecure. The function neither sends a SNI TLS extension nor validates the server hostname. Code is subject to :cwe:`295` (Improper Certificate Validation). (Contributed by Victor Stinner in :gh:`94199`.)
it_it: Rimuovere la funzione :func:`!ssl.wrap_socket`, deprecata in Python 3.7: creare invece un oggetto :class:`ssl.SSLContext` e chiamare il suo metodo :class:`ssl.SSLContext.wrap_socket`. Qualsiasi pacchetto che utilizza ancora :func:`!ssl.wrap_socket` è rotto e non sicuro. La funzione non invia né un'estensione TLS SNI né valida l'hostname del server. Il codice è soggetto a :cwe:`295` (Validazione Impropria del Certificato). (Contributo di Victor Stinner in :gh:`94199`.)

source: Remove many long-deprecated :mod:`unittest` features:
it_it: Rimuovere molte funzionalità di :mod:`unittest` deprecate da lungo tempo:

source: A number of :class:`~unittest.TestCase` method aliases:
it_it: Un certo numero di alias di metodo di :class:`~unittest.TestCase`:

source: Deprecated alias
it_it: Alias deprecato

source: Method Name
it_it: Nome del Metodo

source: Deprecated in
it_it: Deprecato in

source: You can use https://github.com/isidentical/teyit to automatically modernise your unit tests.
it_it: Puoi usare https://github.com/isidentical/teyit per modernizzare automaticamente i tuoi test unitari.

source: Undocumented and broken :class:`~unittest.TestCase` method ``assertDictContainsSubset`` (deprecated in Python 3.2).
it_it: Metodo :class:`~unittest.TestCase` ``assertDictContainsSubset`` non documentato e malfunzionante (deprecato in Python 3.2).

source: Undocumented :meth:`TestLoader.loadTestsFromModule <unittest.TestLoader.loadTestsFromModule>` parameter *use_load_tests* (deprecated and ignored since Python 3.5).
it_it: Parametro non documentato :meth:`TestLoader.loadTestsFromModule <unittest.TestLoader.loadTestsFromModule>` *use_load_tests* (deprecato e ignorato da Python 3.5).

source: An alias of the :class:`~unittest.TextTestResult` class: ``_TextTestResult`` (deprecated in Python 3.2).
it_it: Un alias della classe :class:`~unittest.TextTestResult`: ``_TextTestResult`` (deprecato in Python 3.2).

source: (Contributed by Serhiy Storchaka in :gh:`89325`.)
it_it: (Contribuito da Serhiy Storchaka in :gh:`89325`.)
