Repository: python/python-docs-it
Catalog: whatsnew/3.12.po
Languages: it_it

source: :func:`importlib.resources.as_file` now supports resource directories. (Contributed by Jason R. Coombs in :gh:`97930`.)
it_it: :func:`importlib.resources.as_file` supporta ora le directory di risorse. (Contributo di Jason R. Coombs in :gh:`97930`.)

source: Rename first parameter of :func:`importlib.resources.files` to *anchor*. (Contributed by Jason R. Coombs in :gh:`100598`.)
it_it: Rinominare il primo parametro di :func:`importlib.resources.files` in *anchor*. (Contributo di Jason R. Coombs in :gh:`100598`.)

source: Add :func:`inspect.markcoroutinefunction` to mark sync functions that return a :term:`coroutine` for use with :func:`inspect.iscoroutinefunction`. (Contributed by Carlton Gibson in :gh:`99247`.)
it_it: Aggiungo :func:`inspect.markcoroutinefunction` per contrassegnare le funzioni sync che restituiscono una :term:`coroutine` per l'uso con :func:`inspect.iscoroutinefunction`. (Contributo di Carlton Gibson in :gh:`99247`.)

source: Add :func:`inspect.getasyncgenstate` and :func:`inspect.getasyncgenlocals` for determining the current state of asynchronous generators. (Contributed by Thomas Krennwallner in :gh:`79940`.)
it_it: Aggiungo :func:`inspect.getasyncgenstate` e :func:`inspect.getasyncgenlocals` per determinare lo stato corrente dei generatori asincroni. (Contributo di Thomas Krennwallner in :gh:`79940`.)

source: The performance of :func:`inspect.getattr_static` has been considerably improved. Most calls to the function should be at least 2x faster than they were in Python 3.11. (Contributed by Alex Waygood in :gh:`103193`.)
it_it: Le prestazioni di :func:`inspect.getattr_static` sono state notevolmente migliorate. La maggior parte delle chiamate a questa funzione dovrebbe essere almeno 2x più veloce rispetto a Python 3.11. (Contributo di Alex Waygood in :gh:`103193`.)

source: Add :class:`itertools.batched()` for collecting into even-sized tuples where the last batch may be shorter than the rest. (Contributed by Raymond Hettinger in :gh:`98363`.)
it_it: Aggiungi :class:`itertools.batched()` per raccogliere tuple di dimensioni uniformi dove l'ultima batch può essere più corta delle altre. (Contribuito da Raymond Hettinger in :gh:`98363`.)

source: math
it_it: matematica

source: Add :func:`math.sumprod` for computing a sum of products. (Contributed by Raymond Hettinger in :gh:`100485`.)
it_it: Aggiungi :func:`math.sumprod` per calcolare una somma di prodotti. (Contribuito da Raymond Hettinger in :gh:`100485`.)

source: Extend :func:`math.nextafter` to include a *steps* argument for moving up or down multiple steps at a time. (Contributed by Matthias Goergens, Mark Dickinson, and Raymond Hettinger in :gh:`94906`.)
it_it: Estendere :func:`math.nextafter` per includere un argomento *steps* per muoversi su o giù di più passi alla volta. (Contribuito da Matthias Goergens, Mark Dickinson, e Raymond Hettinger in :gh:`94906`.)

source: Add :const:`os.PIDFD_NONBLOCK` to open a file descriptor for a process with :func:`os.pidfd_open` in non-blocking mode. (Contributed by Kumar Aditya in :gh:`93312`.)
it_it: Aggiungi :const:`os.PIDFD_NONBLOCK` per aprire un file descriptor per un processo con :func:`os.pidfd_open` in modalità non bloccante. (Contribuito da Kumar Aditya in :gh:`93312`.)

source: :class:`os.DirEntry` now includes an :meth:`os.DirEntry.is_junction` method to check if the entry is a junction. (Contributed by Charles Machalow in :gh:`99547`.)
it_it: :class:`os.DirEntry` ora include un metodo :meth:`os.DirEntry.is_junction` per verificare se l'elemento è una giunzione. (Contribuito da Charles Machalow in :gh:`99547`.)

source: Add :func:`os.listdrives`, :func:`os.listvolumes` and :func:`os.listmounts` functions on Windows for enumerating drives, volumes and mount points. (Contributed by Steve Dower in :gh:`102519`.)
it_it: Aggiungi le funzioni :func:`os.listdrives`, :func:`os.listvolumes` e :func:`os.listmounts` su Windows per enumerare unità, volumi e punti di montaggio. (Contribuito da Steve Dower in :gh:`102519`.)

source: :func:`os.stat` and :func:`os.lstat` are now more accurate on Windows. The ``st_birthtime`` field will now be filled with the creation time of the file, and ``st_ctime`` is deprecated but still contains the creation time (but in the future will return the last metadata change, for consistency with other platforms). ``st_dev`` may be up to 64 bits and ``st_ino`` up to 128 bits depending on your file system, and ``st_rdev`` is always set to zero rather than incorrect values. Both functions may be significantly faster on newer releases of Windows. (Contributed by Steve Dower in :gh:`99726`.)
it_it: Le funzioni :func:`os.stat` e :func:`os.lstat` sono ora più precise su Windows. Il campo ``st_birthtime`` verrà ora riempito con il tempo di creazione del file e ``st_ctime`` è deprecato ma contiene ancora il tempo di creazione (ma in futuro restituirà l'ultima modifica ai metadati, per coerenza con altre piattaforme). ``st_dev`` può essere fino a 64 bit e ``st_ino`` fino a 128 bit a seconda del file system, e ``st_rdev`` è sempre impostato su zero anziché valori errati. Entrambe le funzioni possono essere significativamente più veloci nelle nuove versioni di Windows. (Contribuito da Steve Dower in :gh:`99726`.)

source: As of 3.12.4, :func:`os.mkdir` and :func:`os.makedirs` on Windows now support passing a *mode* value of ``0o700`` to apply access control to the new directory. This implicitly affects :func:`tempfile.mkdtemp` and is a mitigation for :cve:`2024-4030`. Other values for *mode* continue to be ignored. (Contributed by Steve Dower in :gh:`118486`.)
it_it: A partire dalla versione 3.12.4, :func:`os.mkdir` e :func:`os.makedirs` su Windows ora supportano il passaggio di un valore *mode* di ``0o700`` per applicare il controllo degli accessi alla nuova directory. Questo influisce implicitamente su :func:`tempfile.mkdtemp` ed è una mitigazione per :cve:`2024-4030`. Altri valori per *mode* continuano ad essere ignorati. (Contribuito da Steve Dower in :gh:`118486`.)

source: Add :func:`os.path.isjunction` to check if a given path is a junction. (Contributed by Charles Machalow in :gh:`99547`.)
it_it: Aggiungi :func:`os.path.isjunction` per verificare se un determinato percorso è una giunzione. (Contribuito da Charles Machalow in :gh:`99547`.)

source: Add :func:`os.path.splitroot` to split a path into a triad ``(drive, root, tail)``. (Contributed by Barney Gale in :gh:`101000`.)
it_it: Aggiungi :func:`os.path.splitroot` per dividere un percorso in una triade ``(drive, root, tail)``. (Contribuito da Barney Gale in :gh:`101000`.)

source: Add support for subclassing :class:`pathlib.PurePath` and :class:`pathlib.Path`, plus their Posix- and Windows-specific variants. Subclasses may override the :meth:`pathlib.PurePath.with_segments` method to pass information between path instances.
it_it: Aggiungi il supporto per la sottoclassificazione di :class:`pathlib.PurePath` e :class:`pathlib.Path`, oltre alle loro varianti specifiche Posix e Windows. Le sottoclassi possono sovrascrivere il metodo :meth:`pathlib.PurePath.with_segments` per passare informazioni tra le istanze del cammino.

source: Add :meth:`pathlib.Path.walk` for walking the directory trees and generating all file or directory names within them, similar to :func:`os.walk`. (Contributed by Stanislav Zmiev in :gh:`90385`.)
it_it: Aggiungi :meth:`pathlib.Path.walk` per attraversare gli alberi delle directory e generare tutti i nomi di file o directory al loro interno, simile a :func:`os.walk`. (Contribuito da Stanislav Zmiev in :gh:`90385`.)

source: Add *walk_up* optional parameter to :meth:`pathlib.PurePath.relative_to` to allow the insertion of ``..`` entries in the result; this behavior is more consistent with :func:`os.path.relpath`. (Contributed by Domenico Ragusa in :gh:`84538`.)
it_it: Aggiungi il parametro opzionale *walk_up* a :meth:`pathlib.PurePath.relative_to` per permettere l'inserimento di voci ``..`` nel risultato; questo comportamento è più coerente con :func:`os.path.relpath`. (Contribuito da Domenico Ragusa in :gh:`84538`.)

source: Add :meth:`pathlib.Path.is_junction` as a proxy to :func:`os.path.isjunction`. (Contributed by Charles Machalow in :gh:`99547`.)
it_it: Aggiungi :meth:`pathlib.Path.is_junction` come proxy per :func:`os.path.isjunction`. (Contribuito da Charles Machalow in :gh:`99547`.)

source: Add *case_sensitive* optional parameter to :meth:`pathlib.Path.glob`, :meth:`pathlib.Path.rglob` and :meth:`pathlib.PurePath.match` for matching the path's case sensitivity, allowing for more precise control over the matching process.
it_it: Aggiungi il parametro opzionale *case_sensitive* a :meth:`pathlib.Path.glob`, :meth:`pathlib.Path.rglob` e :meth:`pathlib.PurePath.match` per abbinare la sensibilità del percorso, consentendo un controllo più preciso sul processo di abbinamento.

source: Add convenience variables to hold values temporarily for debug session and provide quick access to values like the current frame or the return value. (Contributed by Tian Gao in :gh:`103693`.)
it_it: Aggiungi variabili di convenienza per tenere temporaneamente i valori per la sessione di debug e fornire un accesso rapido a valori come il frame corrente o il valore di ritorno. (Contribuito da Tian Gao in :gh:`103693`.)

source: Add :func:`random.binomialvariate`. (Contributed by Raymond Hettinger in :gh:`81620`.)
it_it: Aggiungi :func:`random.binomialvariate`. (Contribuito da Raymond Hettinger in :gh:`81620`.)

source: Add a default of ``lambd=1.0`` to :func:`random.expovariate`. (Contributed by Raymond Hettinger in :gh:`100234`.)
it_it: Aggiungi un default di ``lambd=1.0`` a :func:`random.expovariate`. (Contribuito da Raymond Hettinger in :gh:`100234`.)

source: :func:`shutil.make_archive` now passes the *root_dir* argument to custom archivers which support it. In this case it no longer temporarily changes the current working directory of the process to *root_dir* to perform archiving. (Contributed by Serhiy Storchaka in :gh:`74696`.)
it_it: :func:`shutil.make_archive` ora passa l'argomento *root_dir* agli archiviatori personalizzati che lo supportano. In questo caso, non cambia più temporaneamente la directory di lavoro corrente del processo in *root_dir* per eseguire l'archiviazione. (Contribuito da Serhiy Storchaka in :gh:`74696`.)

source: :func:`shutil.rmtree` now accepts a new argument *onexc* which is an error handler like *onerror* but which expects an exception instance rather than a *(typ, val, tb)* triplet. *onerror* is deprecated. (Contributed by Irit Katriel in :gh:`102828`.)
it_it: :func:`shutil.rmtree` ora accetta un nuovo argomento *onexc* che è un gestore di errori simile a *onerror* ma che si aspetta un'istanza di eccezione piuttosto che un terzetto *(typ, val, tb)*. *onerror* è deprecato. (Contribuito da Irit Katriel in :gh:`102828`.)

source: :func:`shutil.which` now consults the *PATHEXT* environment variable to find matches within *PATH* on Windows even when the given *cmd* includes a directory component. (Contributed by Charles Machalow in :gh:`103179`.)
it_it: :func:`shutil.which` ora consulta la variabile d'ambiente *PATHEXT* per trovare corrispondenze all'interno di *PATH* su Windows anche quando il *cmd* dato include un componente di directory. (Contribuito da Charles Machalow in :gh:`103179`.)

source: :func:`shutil.which` will call ``NeedCurrentDirectoryForExePathW`` when querying for executables on Windows to determine if the current working directory should be prepended to the search path. (Contributed by Charles Machalow in :gh:`103179`.)
it_it: :func:`shutil.which` chiamerà ``NeedCurrentDirectoryForExePathW`` quando interroga per eseguibili su Windows per determinare se la directory di lavoro corrente dovrebbe essere aggiunta al percorso di ricerca. (Contribuito da Charles Machalow in :gh:`103179`.)

source: :func:`shutil.which` will return a path matching the *cmd* with a component from ``PATHEXT`` prior to a direct match elsewhere in the search path on Windows. (Contributed by Charles Machalow in :gh:`103179`.)
it_it: :func:`shutil.which` restituirà un percorso corrispondente al *cmd* con un componente da ``PATHEXT`` prima di una corrispondenza diretta altrove nel percorso di ricerca su Windows. (Contribuito da Charles Machalow in :gh:`103179`.)

source: Add a :ref:`command-line interface <sqlite3-cli>`. (Contributed by Erlend E. Aasland in :gh:`77617`.)
it_it: Aggiungi una :ref:`interfaccia da linea di comando <sqlite3-cli>`. (Contribuito da Erlend E. Aasland in :gh:`77617`.)

source: Add the :attr:`sqlite3.Connection.autocommit` attribute to :class:`sqlite3.Connection` and the *autocommit* parameter to :func:`sqlite3.connect` to control :pep:`249`-compliant :ref:`transaction handling <sqlite3-transaction-control-autocommit>`. (Contributed by Erlend E. Aasland in :gh:`83638`.)
it_it: Aggiungi l'attributo :attr:`sqlite3.Connection.autocommit` a :class:`sqlite3.Connection` e il parametro *autocommit* a :func:`sqlite3.connect` per controllare la :pep:`249`-compliant :ref:`gestione delle transazioni <sqlite3-transaction-control-autocommit>`. (Contribuito da Erlend E. Aasland in :gh:`83638`.)

source: Add *entrypoint* keyword-only parameter to :meth:`sqlite3.Connection.load_extension`, for overriding the SQLite extension entry point. (Contributed by Erlend E. Aasland in :gh:`103015`.)
it_it: Aggiungi il parametro keyword-only *entrypoint* a :meth:`sqlite3.Connection.load_extension`, per sovrascrivere il punto di ingresso dell'estensione SQLite. (Contribuito da Erlend E. Aasland in :gh:`103015`.)

source: Add :meth:`sqlite3.Connection.getconfig` and :meth:`sqlite3.Connection.setconfig` to :class:`sqlite3.Connection` to make configuration changes to a database connection. (Contributed by Erlend E. Aasland in :gh:`103489`.)
it_it: Aggiungi :meth:`sqlite3.Connection.getconfig` e :meth:`sqlite3.Connection.setconfig` a :class:`sqlite3.Connection` per apportare modifiche di configurazione a una connessione al database. (Contribuito da Erlend E. Aasland in :gh:`103489`.)

source: statistics
it_it: statistica

source: Extend :func:`statistics.correlation` to include as a ``ranked`` method for computing the Spearman correlation of ranked data. (Contributed by Raymond Hettinger in :gh:`95861`.)
it_it: Estendere :func:`statistics.correlation` per includere un metodo ``ranked`` per calcolare la correlazione di Spearman di dati classificati. (Contribuito da Raymond Hettinger in :gh:`95861`.)

source: Add the :mod:`sys.monitoring` namespace to expose the new :ref:`PEP 669 <whatsnew312-pep669>` monitoring API. (Contributed by Mark Shannon in :gh:`103082`.)
it_it: Aggiungi lo spazio dei nomi :mod:`sys.monitoring` per esporre la nuova API di monitoraggio :ref:`PEP 669 <whatsnew312-pep669>`. (Contribuito da Mark Shannon in :gh:`103082`.)

source: Add :func:`sys.activate_stack_trampoline` and :func:`sys.deactivate_stack_trampoline` for activating and deactivating stack profiler trampolines, and :func:`sys.is_stack_trampoline_active` for querying if stack profiler trampolines are active. (Contributed by Pablo Galindo and Christian Heimes with contributions from Gregory P. Smith [Google] and Mark Shannon in :gh:`96123`.)
it_it: Aggiungi :func:`sys.activate_stack_trampoline` e :func:`sys.deactivate_stack_trampoline` per attivare e disattivare i trampolini del profiler di stack, e :func:`sys.is_stack_trampoline_active` per verificare se i trampolini del profiler di stack sono attivi. (Contribuito da Pablo Galindo e Christian Heimes con contributi di Gregory P. Smith [Google] e Mark Shannon in :gh:`96123`.)

source: Add :data:`sys.last_exc` which holds the last unhandled exception that was raised (for post-mortem debugging use cases). Deprecate the three fields that have the same information in its legacy form: :data:`sys.last_type`, :data:`sys.last_value` and :data:`sys.last_traceback`. (Contributed by Irit Katriel in :gh:`102778`.)
it_it: Aggiungi :data:`sys.last_exc` che contiene l'ultima eccezione non gestita che è stata sollevata (per casi d'uso di debug post-mortem). Deprecati i tre campi che contengono le stesse informazioni nella loro forma legacy: :data:`sys.last_type`, :data:`sys.last_value` e :data:`sys.last_traceback`. (Contribuito da Irit Katriel in :gh:`102778`.)

source: :func:`sys._current_exceptions` now returns a mapping from thread-id to an exception instance, rather than to a ``(typ, exc, tb)`` tuple. (Contributed by Irit Katriel in :gh:`103176`.)
it_it: :func:`sys._current_exceptions` ora restituisce una mappa da thread-id a un'istanza di eccezione, anziché a una tupla ``(typ, exc, tb)``. (Contribuito da Irit Katriel in :gh:`103176`.)

source: :func:`sys.setrecursionlimit` and :func:`sys.getrecursionlimit`. The recursion limit now applies only to Python code. Builtin functions do not use the recursion limit, but are protected by a different mechanism that prevents recursion from causing a virtual machine crash.
it_it: :func:`sys.setrecursionlimit` e :func:`sys.getrecursionlimit`. Il limite di ricorsione ora si applica solo al codice Python. Le funzioni built-in non utilizzano il limite di ricorsione, ma sono protette da un diverso meccanismo che impedisce alla ricorsione di causare il crash della macchina virtuale.

source: The :class:`tempfile.NamedTemporaryFile` function has a new optional parameter *delete_on_close* (Contributed by Evgeny Zorin in :gh:`58451`.)
it_it: La funzione :class:`tempfile.NamedTemporaryFile` ha un nuovo parametro opzionale *delete_on_close* (Contribuito da Evgeny Zorin in :gh:`58451`.)

source: :func:`tempfile.mkdtemp` now always returns an absolute path, even if the argument provided to the *dir* parameter is a relative path.
it_it: :func:`tempfile.mkdtemp` ora ritorna sempre un percorso assoluto, anche se l'argomento fornito al parametro *dir* è un percorso relativo.

source: As of 3.12.4 on Windows, the default mode ``0o700`` used by :func:`tempfile.mkdtemp` now limits access to the new directory due to changes to :func:`os.mkdir`. This is a mitigation for :cve:`2024-4030`. (Contributed by Steve Dower in :gh:`118486`.)
it_it: A partire dalla versione 3.12.4 su Windows, la modalità predefinita ``0o700`` utilizzata da :func:`tempfile.mkdtemp` ora limita l'accesso alla nuova directory a causa di modifiche a :func:`os.mkdir`. Questa è una mitigazione per :cve:`2024-4030`. (Contribuito da Steve Dower in :gh:`118486`.)

source: Add :func:`threading.settrace_all_threads` and :func:`threading.setprofile_all_threads` that allow to set tracing and profiling functions in all running threads in addition to the calling one. (Contributed by Pablo Galindo in :gh:`93503`.)
it_it: Aggiungi :func:`threading.settrace_all_threads` e :func:`threading.setprofile_all_threads` che permettono di impostare funzioni di traccia e di profilazione in tutti i thread in esecuzione oltre a quello chiamante. (Contribuito da Pablo Galindo in :gh:`93503`.)

source: ``tkinter.Canvas.coords()`` now flattens its arguments. It now accepts not only coordinates as separate arguments (``x1, y1, x2, y2, ...``) and a sequence of coordinates (``[x1, y1, x2, y2, ...]``), but also coordinates grouped in pairs (``(x1, y1), (x2, y2), ...`` and ``[(x1, y1), (x2, y2), ...]``), like ``create_*()`` methods. (Contributed by Serhiy Storchaka in :gh:`94473`.)
it_it: ``tkinter.Canvas.coords()`` ora appiattisce i suoi argomenti. Ora accetta non solo coordinate come argomenti separati (``x1, y1, x2, y2, ...``) e una sequenza di coordinate (``[x1, y1, x2, y2, ...]``), ma anche coordinate raggruppate in coppie (``(x1, y1), (x2, y2), ...`` e ``[(x1, y1), (x2, y2), ...]``), come i metodi ``create_*()``. (Contributo di Serhiy Storchaka in :gh:`94473`.)

source: The :mod:`tokenize` module includes the changes introduced in :pep:`701`. (Contributed by Marta Gómez Macías and Pablo Galindo in :gh:`102856`.) See :ref:`whatsnew312-porting-to-python312` for more information on the changes to the :mod:`tokenize` module.
it_it: Il modulo :mod:`tokenize` include le modifiche introdotte in :pep:`701`. (Contributo di Marta Gómez Macías e Pablo Galindo in :gh:`102856`.) Vedi :ref:`whatsnew312-porting-to-python312` per maggiori informazioni sulle modifiche al modulo :mod:`tokenize`.

source: Add :func:`types.get_original_bases` to allow for further introspection of :ref:`user-defined-generics` when subclassed. (Contributed by James Hilton-Balfe and Alex Waygood in :gh:`101827`.)
it_it: Aggiungi :func:`types.get_original_bases` per consentire ulteriori introspezioni dei :ref:`user-defined-generics` quando sottoclassati. (Contributo di James Hilton-Balfe e Alex Waygood in :gh:`101827`.)

source: :func:`isinstance` checks against :func:`runtime-checkable protocols <typing.runtime_checkable>` now use :func:`inspect.getattr_static` rather than :func:`hasattr` to lookup whether attributes exist. This means that descriptors and :meth:`~object.__getattr__` methods are no longer unexpectedly evaluated during ``isinstance()`` checks against runtime-checkable protocols. However, it may also mean that some objects which used to be considered instances of a runtime-checkable protocol may no longer be considered instances of that protocol on Python 3.12+, and vice versa. Most users are unlikely to be affected by this change. (Contributed by Alex Waygood in :gh:`102433`.)
it_it: I controlli :func:`isinstance` contro i :func:`runtime-checkable protocols <typing.runtime_checkable>` ora utilizzano :func:`inspect.getattr_static` anziché :func:`hasattr` per verificare l'esistenza degli attributi. Ciò significa che i descrittori e i metodi :meth:`~object.__getattr__` non vengono più valutati inaspettatamente durante i controlli ``isinstance()`` contro i protocolli verificabili a runtime. Tuttavia, ciò può anche significare che alcuni oggetti che in precedenza erano considerati istanze di un protocollo verificabile a runtime potrebbero non essere più considerati tali con Python 3.12+ e viceversa. La maggior parte degli utenti non dovrebbe essere influenzata da questo cambiamento. (Contributo di Alex Waygood in :gh:`102433`.)

source: The members of a runtime-checkable protocol are now considered "frozen" at runtime as soon as the class has been created. Monkey-patching attributes onto a runtime-checkable protocol will still work, but will have no impact on :func:`isinstance` checks comparing objects to the protocol. For example::
it_it: I membri di un protocollo verificabile a runtime sono ora considerati "congelati" a runtime non appena la classe è stata creata. Il monkey-patching degli attributi in un protocollo verificabile a runtime funzionerà ancora, ma non avrà alcun impatto sui controlli :func:`isinstance` che confrontano oggetti con il protocollo. Per esempio::

source: This change was made in order to speed up ``isinstance()`` checks against runtime-checkable protocols.
it_it: Questa modifica è stata apportata per velocizzare i controlli ``isinstance()`` contro i protocolli verificabili a runtime.
