Repository: python/python-docs-it
Catalog: whatsnew/3.12.po
Languages: it_it

source: The performance profile of :func:`isinstance` checks against :func:`runtime-checkable protocols <typing.runtime_checkable>` has changed significantly. Most ``isinstance()`` checks against protocols with only a few members should be at least 2x faster than in 3.11, and some may be 20x faster or more. However, ``isinstance()`` checks against protocols with many members may be slower than in Python 3.11. (Contributed by Alex Waygood in :gh:`74690` and :gh:`103193`.)
it_it: Il profilo delle prestazioni dei controlli :func:`isinstance` contro i :func:`runtime-checkable protocols <typing.runtime_checkable>` è cambiato significativamente. La maggior parte dei controlli ``isinstance()`` contro i protocolli con pochi membri dovrebbe essere almeno 2 volte più veloce rispetto alla versione 3.11, e alcuni potrebbero essere 20 volte più veloci o più. Tuttavia, i controlli ``isinstance()`` contro i protocolli con molti membri potrebbero risultare più lenti rispetto a Python 3.11. (Contributo di Alex Waygood in :gh:`74690` e :gh:`103193`.)

source: All :data:`typing.TypedDict` and :data:`typing.NamedTuple` classes now have the ``__orig_bases__`` attribute. (Contributed by Adrian Garcia Badaracco in :gh:`103699`.)
it_it: Tutte le classi :data:`typing.TypedDict` e :data:`typing.NamedTuple` ora possiedono l'attributo ``__orig_bases__``. (Contributo di Adrian Garcia Badaracco in :gh:`103699`.)

source: Add ``frozen_default`` parameter to :func:`typing.dataclass_transform`. (Contributed by Erik De Bonte in :gh:`99957`.)
it_it: Aggiungi il parametro ``frozen_default`` a :func:`typing.dataclass_transform`. (Contributo di Erik De Bonte in :gh:`99957`.)

source: The Unicode database has been updated to version 15.0.0. (Contributed by Benjamin Peterson in :gh:`96734`).
it_it: Il database Unicode è stato aggiornato alla versione 15.0.0. (Contributo di Benjamin Peterson in :gh:`96734`).

source: Add a ``--durations`` command line option, showing the N slowest test cases::
it_it: Aggiungi l'opzione di linea di comando ``--durations``, che mostra i N casi di test più lenti::

source: (Contributed by Giampaolo Rodola in :gh:`48330`)
it_it: (Contributo di Giampaolo Rodola in :gh:`48330`)

source: Add a :ref:`command-line interface <uuid-cli>`. (Contributed by Adam Chhina in :gh:`88597`.)
it_it: Aggiungi una :ref:`interfaccia della linea di comando <uuid-cli>`. (Contributo di Adam Chhina in :gh:`88597`.)

source: Optimizations
it_it: Ottimizzazioni

source: Remove ``wstr`` and ``wstr_length`` members from Unicode objects. It reduces object size by 8 or 16 bytes on 64bit platform. (:pep:`623`) (Contributed by Inada Naoki in :gh:`92536`.)
it_it: Rimuovi i membri ``wstr`` e ``wstr_length`` dagli oggetti Unicode. Ciò riduce la dimensione degli oggetti di 8 o 16 byte sulla piattaforma a 64 bit. (:pep:`623`) (Contributo di Inada Naoki in :gh:`92536`.)

source: Add experimental support for using the BOLT binary optimizer in the build process, which improves performance by 1-5%. (Contributed by Kevin Modzelewski in :gh:`90536` and tuned by Donghee Na in :gh:`101525`)
it_it: Aggiungi il supporto sperimentale per l'uso dell'ottimizzatore binario BOLT nel processo di build, che migliora le prestazioni dell'1-5%. (Contributo di Kevin Modzelewski in :gh:`90536` e ottimizzato da Donghee Na in :gh:`101525`)

source: Speed up the regular expression substitution (functions :func:`re.sub` and :func:`re.subn` and corresponding :class:`!re.Pattern` methods) for replacement strings containing group references by 2--3 times. (Contributed by Serhiy Storchaka in :gh:`91524`.)
it_it: Velocizza la sostituzione delle espressioni regolari (funzioni :func:`re.sub` e :func:`re.subn` e i corrispondenti metodi di :class:`!re.Pattern`) per le stringhe di sostituzione contenenti riferimenti di gruppo di 2-3 volte. (Contributo di Serhiy Storchaka in :gh:`91524`.)

source: Speed up :class:`asyncio.Task` creation by deferring expensive string formatting. (Contributed by Itamar Oren in :gh:`103793`.)
it_it: Velocizza la creazione di :class:`asyncio.Task` rimandando la formattazione delle stringhe costosa. (Contributo di Itamar Oren in :gh:`103793`.)

source: The :func:`tokenize.tokenize` and :func:`tokenize.generate_tokens` functions are up to 64% faster as a side effect of the changes required to cover :pep:`701` in the :mod:`tokenize` module. (Contributed by Marta Gómez Macías and Pablo Galindo in :gh:`102856`.)
it_it: Le funzioni :func:`tokenize.tokenize` e :func:`tokenize.generate_tokens` sono fino al 64% più veloci come effetto collaterale delle modifiche necessarie per coprire :pep:`701` nel modulo :mod:`tokenize`. (Contributo di Marta Gómez Macías e Pablo Galindo in :gh:`102856`.)

source: Speed up :func:`super` method calls and attribute loads via the new :opcode:`LOAD_SUPER_ATTR` instruction. (Contributed by Carl Meyer and Vladimir Matveev in :gh:`103497`.)
it_it: Velocizza le chiamate al metodo :func:`super` e i caricamenti degli attributi tramite la nuova istruzione :opcode:`LOAD_SUPER_ATTR`. (Contributo di Carl Meyer e Vladimir Matveev in :gh:`103497`.)

source: CPython bytecode changes
it_it: Modifiche al bytecode di CPython

source: Remove the :opcode:`!LOAD_METHOD` instruction. It has been merged into :opcode:`LOAD_ATTR`. :opcode:`LOAD_ATTR` will now behave like the old :opcode:`!LOAD_METHOD` instruction if the low bit of its oparg is set. (Contributed by Ken Jin in :gh:`93429`.)
it_it: Rimuovi l'istruzione :opcode:`!LOAD_METHOD`. È stata unita a :opcode:`LOAD_ATTR`. Ora :opcode:`LOAD_ATTR` si comporterà come la vecchia istruzione :opcode:`!LOAD_METHOD` se il bit inferiore del suo oparg è impostato. (Contributo di Ken Jin in :gh:`93429`.)

source: Remove the :opcode:`!JUMP_IF_FALSE_OR_POP` and :opcode:`!JUMP_IF_TRUE_OR_POP` instructions. (Contributed by Irit Katriel in :gh:`102859`.)
it_it: Rimuovi le istruzioni :opcode:`!JUMP_IF_FALSE_OR_POP` e :opcode:`!JUMP_IF_TRUE_OR_POP`. (Contributo di Irit Katriel in :gh:`102859`.)

source: Remove the :opcode:`!PRECALL` instruction. (Contributed by Mark Shannon in :gh:`92925`.)
it_it: Rimuovi l'istruzione :opcode:`!PRECALL`. (Contributo di Mark Shannon in :gh:`92925`.)

source: Add the :opcode:`BINARY_SLICE` and :opcode:`STORE_SLICE` instructions. (Contributed by Mark Shannon in :gh:`94163`.)
it_it: Aggiungi le istruzioni :opcode:`BINARY_SLICE` e :opcode:`STORE_SLICE`. (Contributo di Mark Shannon in :gh:`94163`.)

source: Add the :opcode:`CALL_INTRINSIC_1` instructions. (Contributed by Mark Shannon in :gh:`99005`.)
it_it: Aggiungi le istruzioni :opcode:`CALL_INTRINSIC_1`. (Contributo di Mark Shannon in :gh:`99005`.)

source: Add the :opcode:`CALL_INTRINSIC_2` instruction. (Contributed by Irit Katriel in :gh:`101799`.)
it_it: Aggiungi l'istruzione :opcode:`CALL_INTRINSIC_2`. (Contributo di Irit Katriel in :gh:`101799`.)

source: Add the :opcode:`CLEANUP_THROW` instruction. (Contributed by Brandt Bucher in :gh:`90997`.)
it_it: Aggiungi l'istruzione :opcode:`CLEANUP_THROW`. (Contributo di Brandt Bucher in :gh:`90997`.)

source: Add the :opcode:`!END_SEND` instruction. (Contributed by Mark Shannon in :gh:`103082`.)
it_it: Aggiungi l'istruzione :opcode:`!END_SEND`. (Contributo di Mark Shannon in :gh:`103082`.)

source: Add the :opcode:`LOAD_FAST_AND_CLEAR` instruction as part of the implementation of :pep:`709`. (Contributed by Carl Meyer in :gh:`101441`.)
it_it: Aggiungi l'istruzione :opcode:`LOAD_FAST_AND_CLEAR` come parte dell'implementazione di :pep:`709`. (Contributo di Carl Meyer in :gh:`101441`.)

source: Add the :opcode:`LOAD_FAST_CHECK` instruction. (Contributed by Dennis Sweeney in :gh:`93143`.)
it_it: Aggiungi l'istruzione :opcode:`LOAD_FAST_CHECK`. (Contributo di Dennis Sweeney in :gh:`93143`.)

source: Add the :opcode:`LOAD_FROM_DICT_OR_DEREF`, :opcode:`LOAD_FROM_DICT_OR_GLOBALS`, and :opcode:`LOAD_LOCALS` opcodes as part of the implementation of :pep:`695`. Remove the :opcode:`!LOAD_CLASSDEREF` opcode, which can be replaced with :opcode:`LOAD_LOCALS` plus :opcode:`LOAD_FROM_DICT_OR_DEREF`. (Contributed by Jelle Zijlstra in :gh:`103764`.)
it_it: Aggiungi le istruzioni :opcode:`LOAD_FROM_DICT_OR_DEREF`, :opcode:`LOAD_FROM_DICT_OR_GLOBALS`, e :opcode:`LOAD_LOCALS` come parte dell'implementazione di :pep:`695`. Rimuovi l'opcode :opcode:`!LOAD_CLASSDEREF`, che può essere sostituito con :opcode:`LOAD_LOCALS` più :opcode:`LOAD_FROM_DICT_OR_DEREF`. (Contributo di Jelle Zijlstra in :gh:`103764`.)

source: Add the :opcode:`LOAD_SUPER_ATTR` instruction. (Contributed by Carl Meyer and Vladimir Matveev in :gh:`103497`.)
it_it: Aggiungi l'istruzione :opcode:`LOAD_SUPER_ATTR`. (Contributo di Carl Meyer e Vladimir Matveev in :gh:`103497`.)

source: Add the :opcode:`RETURN_CONST` instruction. (Contributed by Wenyang Wang in :gh:`101632`.)
it_it: Aggiungi l'istruzione :opcode:`RETURN_CONST`. (Contributo di Wenyang Wang in :gh:`101632`.)

source: Demos and Tools
it_it: Demos e Tools

source: Remove the ``Tools/demo/`` directory which contained old demo scripts. A copy can be found in the `old-demos project <https://github.com/gvanrossum/old-demos>`_. (Contributed by Victor Stinner in :gh:`97681`.)
it_it: Rimuovi la directory ``Tools/demo/`` che conteneva vecchi script demo. Una copia può essere trovata nel `progetto old-demos <https://github.com/gvanrossum/old-demos>`_. (Contributo di Victor Stinner in :gh:`97681`.)

source: Remove outdated example scripts of the ``Tools/scripts/`` directory. A copy can be found in the `old-demos project <https://github.com/gvanrossum/old-demos>`_. (Contributed by Victor Stinner in :gh:`97669`.)
it_it: Rimuovi script di esempio obsoleti dalla directory ``Tools/scripts/``. Una copia può essere trovata nel `progetto old-demos <https://github.com/gvanrossum/old-demos>`_. (Contributo di Victor Stinner in :gh:`97669`.)

source: Deprecated
it_it: Deprecato

source: :mod:`argparse`: The *type*, *choices*, and *metavar* parameters of :class:`!argparse.BooleanOptionalAction` are deprecated and will be removed in 3.14. (Contributed by Nikita Sobolev in :gh:`92248`.)
it_it: :mod:`argparse`: I parametri *type*, *choices* e *metavar* di :class:`!argparse.BooleanOptionalAction` sono deprecati e saranno rimossi nella versione 3.14. (Contributo di Nikita Sobolev in :gh:`92248`.)

source: :mod:`ast`: The following :mod:`ast` features have been deprecated in documentation since Python 3.8, now cause a :exc:`DeprecationWarning` to be emitted at runtime when they are accessed or used, and will be removed in Python 3.14:
it_it: :mod:`ast`: Le seguenti caratteristiche di :mod:`ast` sono deprecate nella documentazione da Python 3.8, ora causano un'emissione di :exc:`DeprecationWarning` al runtime quando vengono accedute o utilizzate, e saranno rimosse in Python 3.14:

source: Use :class:`ast.Constant` instead. (Contributed by Serhiy Storchaka in :gh:`90953`.)
it_it: Utilizzare :class:`ast.Constant` al suo posto. (Contributo di Serhiy Storchaka in :gh:`90953`.)

source: The child watcher classes :class:`asyncio.MultiLoopChildWatcher`, :class:`asyncio.FastChildWatcher`, :class:`asyncio.AbstractChildWatcher` and :class:`asyncio.SafeChildWatcher` are deprecated and will be removed in Python 3.14. (Contributed by Kumar Aditya in :gh:`94597`.)
it_it: Le classi watcher dei processi figli :class:`asyncio.MultiLoopChildWatcher`, :class:`asyncio.FastChildWatcher`, :class:`asyncio.AbstractChildWatcher` e :class:`asyncio.SafeChildWatcher` sono deprecate e saranno rimosse in Python 3.14. (Contributo di Kumar Aditya in :gh:`94597`.)

source: :func:`asyncio.set_child_watcher`, :func:`asyncio.get_child_watcher`, :meth:`asyncio.AbstractEventLoopPolicy.set_child_watcher` and :meth:`asyncio.AbstractEventLoopPolicy.get_child_watcher` are deprecated and will be removed in Python 3.14. (Contributed by Kumar Aditya in :gh:`94597`.)
it_it: Le funzioni :func:`asyncio.set_child_watcher`, :func:`asyncio.get_child_watcher`, :meth:`asyncio.AbstractEventLoopPolicy.set_child_watcher` e :meth:`asyncio.AbstractEventLoopPolicy.get_child_watcher` sono deprecate e saranno rimosse in Python 3.14. (Contributo di Kumar Aditya in :gh:`94597`.)

source: The :meth:`~asyncio.get_event_loop` method of the default event loop policy now emits a :exc:`DeprecationWarning` if there is no current event loop set and it decides to create one. (Contributed by Serhiy Storchaka and Guido van Rossum in :gh:`100160`.)
it_it: Il metodo :meth:`~asyncio.get_event_loop` della politica del ciclo di eventi predefinito ora emette un :exc:`DeprecationWarning` se non c'è alcun ciclo di eventi corrente impostato e decide di crearne uno. (Contributo di Serhiy Storchaka e Guido van Rossum in :gh:`100160`.)

source: :mod:`calendar`: ``calendar.January`` and ``calendar.February`` constants are deprecated and replaced by :data:`calendar.JANUARY` and :data:`calendar.FEBRUARY`. (Contributed by Prince Roshan in :gh:`103636`.)
it_it: :mod:`calendar`: Le costanti ``calendar.January`` e ``calendar.February`` sono deprecate e sostituite da :data:`calendar.JANUARY` e :data:`calendar.FEBRUARY`. (Contributo di Prince Roshan in :gh:`103636`.)

source: :mod:`collections.abc`: Deprecated :class:`collections.abc.ByteString`. Prefer :class:`Sequence` or :class:`collections.abc.Buffer`. For use in typing, prefer a union, like ``bytes | bytearray``, or :class:`collections.abc.Buffer`. (Contributed by Shantanu Jain in :gh:`91896`.)
it_it: :mod:`collections.abc`: Deprecata :class:`collections.abc.ByteString`. Preferire :class:`Sequence` o :class:`collections.abc.Buffer`. Per l'uso nei tipi, preferire una unione, come ``bytes | bytearray``, o :class:`collections.abc.Buffer`. (Contributo di Shantanu Jain in :gh:`91896`.)

source: :mod:`datetime`: :class:`datetime.datetime`'s :meth:`~datetime.datetime.utcnow` and :meth:`~datetime.datetime.utcfromtimestamp` are deprecated and will be removed in a future version. Instead, use timezone-aware objects to represent datetimes in UTC: respectively, call :meth:`~datetime.datetime.now` and :meth:`~datetime.datetime.fromtimestamp` with the *tz* parameter set to :const:`datetime.UTC`. (Contributed by Paul Ganssle in :gh:`103857`.)
it_it: :mod:`datetime`: I metodi :meth:`~datetime.datetime.utcnow` e :meth:`~datetime.datetime.utcfromtimestamp` della classe :class:`datetime.datetime` sono deprecati e saranno rimossi in una futura versione. Invece, utilizzare oggetti timezone-aware per rappresentare i datetime in UTC: rispettivamente, chiamare :meth:`~datetime.datetime.now` e :meth:`~datetime.datetime.fromtimestamp` con il parametro *tz* impostato su :const:`datetime.UTC`. (Contributo di Paul Ganssle in :gh:`103857`.)

source: :mod:`email`: Deprecate the *isdst* parameter in :func:`email.utils.localtime`. (Contributed by Alan Williams in :gh:`72346`.)
it_it: :mod:`email`: Deprecato il parametro *isdst* in :func:`email.utils.localtime`. (Contributo di Alan Williams in :gh:`72346`.)

source: :mod:`importlib.abc`: Deprecated the following classes, scheduled for removal in Python 3.14:
it_it: :mod:`importlib.abc`: Deprecate le seguenti classi, pianificate per la rimozione in Python 3.14:

source: Use :mod:`importlib.resources.abc` classes instead:
it_it: Utilizzare invece le classi del modulo :mod:`importlib.resources.abc`:

source: (Contributed by Jason R. Coombs and Hugo van Kemenade in :gh:`93963`.)
it_it: (Contributo di Jason R. Coombs e Hugo van Kemenade in :gh:`93963`.)

source: :mod:`itertools`: Deprecate the support for copy, deepcopy, and pickle operations, which is undocumented, inefficient, historically buggy, and inconsistent. This will be removed in 3.14 for a significant reduction in code volume and maintenance burden. (Contributed by Raymond Hettinger in :gh:`101588`.)
it_it: :mod:`itertools`: Deprecato il supporto per operazioni di copy, deepcopy e pickle, che è non documentato, inefficiente, storicamente soggetto a bug e inconsistente. Questo sarà rimosso in 3.14 per una significativa riduzione del volume di codice e del carico di manutenzione. (Contributo di Raymond Hettinger in :gh:`101588`.)

source: :mod:`multiprocessing`: In Python 3.14, the default :mod:`multiprocessing` start method will change to a safer one on Linux, BSDs, and other non-macOS POSIX platforms where ``'fork'`` is currently the default (:gh:`84559`). Adding a runtime warning about this was deemed too disruptive as the majority of code is not expected to care. Use the :func:`~multiprocessing.get_context` or :func:`~multiprocessing.set_start_method` APIs to explicitly specify when your code *requires* ``'fork'``. See :ref:`contexts and start methods <multiprocessing-start-methods>`.
it_it: :mod:`multiprocessing`: In Python 3.14, il metodo di avvio predefinito di :mod:`multiprocessing` cambierà in uno più sicuro su Linux, BSD e altre piattaforme POSIX non macOS dove ``'fork'`` è attualmente il predefinito (:gh:`84559`). Aggiungere un avviso in fase di runtime su questo cambiamento è stato ritenuto troppo dirompente poiché la maggioranza del codice non dovrebbe risentirne. Utilizzare le API :func:`~multiprocessing.get_context` o :func:`~multiprocessing.set_start_method` per specificare esplicitamente quando il codice *richiede* ``'fork'``. Vedi :ref:`contexts and start methods <multiprocessing-start-methods>`.

source: :mod:`pkgutil`: :func:`pkgutil.find_loader` and :func:`pkgutil.get_loader` are deprecated and will be removed in Python 3.14; use :func:`importlib.util.find_spec` instead. (Contributed by Nikita Sobolev in :gh:`97850`.)
it_it: :mod:`pkgutil`: Le funzioni :func:`pkgutil.find_loader` e :func:`pkgutil.get_loader` sono deprecate e saranno rimosse in Python 3.14; utilizzare invece :func:`importlib.util.find_spec`. (Contributo di Nikita Sobolev in :gh:`97850`.)

source: :mod:`pty`: The module has two undocumented ``master_open()`` and ``slave_open()`` functions that have been deprecated since Python 2 but only gained a proper :exc:`DeprecationWarning` in 3.12. Remove them in 3.14. (Contributed by Soumendra Ganguly and Gregory P. Smith in :gh:`85984`.)
it_it: :mod:`pty`: Il modulo ha due funzioni non documentate ``master_open()`` e ``slave_open()`` che sono deprecate da Python 2 ma hanno ottenuto un vero e proprio :exc:`DeprecationWarning` solo in 3.12. Rimuoverle in 3.14. (Contributo di Soumendra Ganguly e Gregory P. Smith in :gh:`85984`.)

source: The ``st_ctime`` fields return by :func:`os.stat` and :func:`os.lstat` on Windows are deprecated. In a future release, they will contain the last metadata change time, consistent with other platforms. For now, they still contain the creation time, which is also available in the new ``st_birthtime`` field. (Contributed by Steve Dower in :gh:`99726`.)
it_it: I campi ``st_ctime`` restituiti da :func:`os.stat` e :func:`os.lstat` su Windows sono deprecati. In una futura versione, conterranno l'ora dell'ultima modifica dei metadati, in linea con altre piattaforme. Per ora, contengono ancora l'ora di creazione, che è anche disponibile nel nuovo campo ``st_birthtime``. (Contributo di Steve Dower in :gh:`99726`.)

source: On POSIX platforms, :func:`os.fork` can now raise a :exc:`DeprecationWarning` when it can detect being called from a multithreaded process. There has always been a fundamental incompatibility with the POSIX platform when doing so. Even if such code *appeared* to work. We added the warning to raise awareness as issues encountered by code doing this are becoming more frequent. See the :func:`os.fork` documentation for more details along with `this discussion on fork being incompatible with threads <https://discuss.python.org/t/33555>`_ for *why* we're now surfacing this longstanding platform compatibility problem to developers.
it_it: Sulle piattaforme POSIX, :func:`os.fork` può ora generare un :exc:`DeprecationWarning` quando rileva di essere chiamata da un processo multithread. C'è sempre stata una incompatibilità fondamentale con la piattaforma POSIX quando si fa così. Anche se tale codice *sembrava* funzionare. Abbiamo aggiunto l'avviso per aumentare la consapevolezza poiché i problemi incontrati dal codice che lo fa stanno diventando più frequenti. Vedere la documentazione di :func:`os.fork` per ulteriori dettagli insieme a `questa discussione sull'incompatibilità di fork con i thread <https://discuss.python.org/t/33555>`_ per *perché* stiamo ora portando questo problema di compatibilità della piattaforma di lunga data all'attenzione degli sviluppatori.

source: When this warning appears due to usage of :mod:`multiprocessing` or :mod:`concurrent.futures` the fix is to use a different :mod:`multiprocessing` start method such as ``"spawn"`` or ``"forkserver"``.
it_it: Quando questo avviso appare a causa dell'uso di :mod:`multiprocessing` o :mod:`concurrent.futures` la soluzione è di utilizzare un diverso metodo di avvio di :mod:`multiprocessing` come ``"spawn"`` o ``"forkserver"``.

source: :mod:`shutil`: The *onerror* argument of :func:`shutil.rmtree` is deprecated; use *onexc* instead. (Contributed by Irit Katriel in :gh:`102828`.)
it_it: :mod:`shutil`: L'argomento *onerror* di :func:`shutil.rmtree` è deprecato; utilizzare *onexc* invece. (Contributo di Irit Katriel in :gh:`102828`.)

source: :ref:`default adapters and converters <sqlite3-default-converters>` are now deprecated. Instead, use the :ref:`sqlite3-adapter-converter-recipes` and tailor them to your needs. (Contributed by Erlend E. Aasland in :gh:`90016`.)
it_it: :ref:`default adapters and converters <sqlite3-default-converters>` sono ora deprecati. Invece, utilizzare :ref:`sqlite3-adapter-converter-recipes` e adattarli alle tue esigenze. (Contributo di Erlend E. Aasland in :gh:`90016`.)

source: In :meth:`~sqlite3.Cursor.execute`, :exc:`DeprecationWarning` is now emitted when :ref:`named placeholders <sqlite3-placeholders>` are used together with parameters supplied as a :term:`sequence` instead of as a :class:`dict`. Starting from Python 3.14, using named placeholders with parameters supplied as a sequence will raise a :exc:`~sqlite3.ProgrammingError`. (Contributed by Erlend E. Aasland in :gh:`101698`.)
it_it: In :meth:`~sqlite3.Cursor.execute`, ora viene emesso un :exc:`DeprecationWarning` quando :ref:`named placeholders <sqlite3-placeholders>` sono utilizzati insieme a parametri forniti come una :term:`sequence` invece che come un :class:`dict`. A partire da Python 3.14, l'uso di named placeholders con parametri forniti come una sequence genererà un :exc:`~sqlite3.ProgrammingError`. (Contributo di Erlend E. Aasland in :gh:`101698`.)

source: :mod:`sys`: The :data:`sys.last_type`, :data:`sys.last_value` and :data:`sys.last_traceback` fields are deprecated. Use :data:`sys.last_exc` instead. (Contributed by Irit Katriel in :gh:`102778`.)
it_it: :mod:`sys`: I campi :data:`sys.last_type`, :data:`sys.last_value` e :data:`sys.last_traceback` sono deprecati. Utilizzare :data:`sys.last_exc` invece. (Contributo di Irit Katriel in :gh:`102778`.)

source: :mod:`tarfile`: Extracting tar archives without specifying *filter* is deprecated until Python 3.14, when ``'data'`` filter will become the default. See :ref:`tarfile-extraction-filter` for details.
it_it: :mod:`tarfile`: L'estrazione degli archivi tar senza specificare *filter* è deprecata fino a Python 3.14, quando il filtro ``'data'`` diventerà il predefinito. Vedere :ref:`tarfile-extraction-filter` per i dettagli.

source: :class:`typing.Hashable` and :class:`typing.Sized`, aliases for :class:`collections.abc.Hashable` and :class:`collections.abc.Sized` respectively, are deprecated. (:gh:`94309`.)
it_it: :class:`typing.Hashable` e :class:`typing.Sized`, alias rispettivamente di :class:`collections.abc.Hashable` e :class:`collections.abc.Sized`, sono deprecati. (:gh:`94309`.)
