Repository: python/python-docs-it
Catalog: whatsnew/3.12.po
Languages: it_it

source: PEP 688: Making the buffer protocol accessible in Python
it_it: PEP 688: Rendere accessibile il protocollo buffer in Python

source: :pep:`688` introduces a way to use the :ref:`buffer protocol <bufferobjects>` from Python code. Classes that implement the :meth:`~object.__buffer__` method are now usable as buffer types.
it_it: :pep:`688` introduce un modo per utilizzare il :ref:`protocollo buffer <bufferobjects>` dal codice Python. Le classi che implementano il metodo :meth:`~object.__buffer__` sono ora utilizzabili come tipi di buffer.

source: The new :class:`collections.abc.Buffer` ABC provides a standard way to represent buffer objects, for example in type annotations. The new :class:`inspect.BufferFlags` enum represents the flags that can be used to customize buffer creation. (Contributed by Jelle Zijlstra in :gh:`102500`.)
it_it: Il nuovo ABC :class:`collections.abc.Buffer` fornisce un modo standard per rappresentare oggetti buffer, ad esempio nelle annotazioni di tipo. Il nuovo enumerativo :class:`inspect.BufferFlags` rappresenta i flag che possono essere utilizzati per personalizzare la creazione del buffer. (Contributo di Jelle Zijlstra in :gh:`102500`.)

source: PEP 709: Comprehension inlining
it_it: PEP 709: Inlining delle comprehension

source: Dictionary, list, and set comprehensions are now inlined, rather than creating a new single-use function object for each execution of the comprehension. This speeds up execution of a comprehension by up to two times. See :pep:`709` for further details.
it_it: Le comprehension di dizionari, liste e set sono ora inlined, piuttosto che creare un nuovo oggetto funzione monouso per ogni esecuzione della comprehension. Questo accelera l'esecuzione di una comprehension fino a due volte. Vedi :pep:`709` per ulteriori dettagli.

source: Comprehension iteration variables remain isolated and don't overwrite a variable of the same name in the outer scope, nor are they visible after the comprehension. Inlining does result in a few visible behavior changes:
it_it: Le variabili di iterazione delle comprehension rimangono isolate e non sovrascrivono una variabile con lo stesso nome nell'ambito esterno, né sono visibili dopo la comprehension. L'inlining comporta alcuni cambiamenti di comportamento visibili:

source: There is no longer a separate frame for the comprehension in tracebacks, and tracing/profiling no longer shows the comprehension as a function call.
it_it: Nei traceback non c'è più un frame separato per la comprehension, e il tracciamento/profiling non mostra più la comprehension come una chiamata di funzione.

source: The :mod:`symtable` module will no longer produce child symbol tables for each comprehension; instead, the comprehension's locals will be included in the parent function's symbol table.
it_it: Il modulo :mod:`symtable` non produrrà più tabelle simbolo figlie per ogni comprehension; invece, le variabili locali della comprehension saranno incluse nella tabella simbolo della funzione principale.

source: Calling :func:`locals` inside a comprehension now includes variables from outside the comprehension, and no longer includes the synthetic ``.0`` variable for the comprehension "argument".
it_it: Chiamando :func:`locals` all'interno di una comprehension ora include variabili dall'esterno della comprehension e non include più la variabile sintetica ``.0`` per "l'argomento" della comprehension.

source: A comprehension iterating directly over ``locals()`` (e.g. ``[k for k in locals()]``) may see "RuntimeError: dictionary changed size during iteration" when run under tracing (e.g. code coverage measurement). This is the same behavior already seen in e.g. ``for k in locals():``. To avoid the error, first create a list of keys to iterate over: ``keys = list(locals()); [k for k in keys]``.
it_it: Una comprehension che itera direttamente su ``locals()`` (ad es. ``[k for k in locals()]``) potrebbe vedere "RuntimeError: dimensione del dizionario cambiata durante l'iterazione" quando eseguita sotto tracciamento (ad es. misurazione della copertura del codice). Questo è lo stesso comportamento già visto, ad es. ``for k in locals():``. Per evitare l'errore, prima crea una lista di chiavi da iterare: ``keys = list(locals()); [k for k in keys]``.

source: (Contributed by Carl Meyer and Vladimir Matveev in :pep:`709`.)
it_it: (Contributi di Carl Meyer e Vladimir Matveev in :pep:`709`.)

source: Improved Error Messages
it_it: Messaggi di errore migliorati

source: Modules from the standard library are now potentially suggested as part of the error messages displayed by the interpreter when a :exc:`NameError` is raised to the top level. (Contributed by Pablo Galindo in :gh:`98254`.)
it_it: I moduli della libreria standard sono ora potenzialmente suggeriti come parte dei messaggi di errore visualizzati dall'interprete quando un'eccezione :exc:`NameError` viene sollevata a livello superiore. (Contributi da Pablo Galindo in :gh:`98254`.)

source: Improve the error suggestion for :exc:`NameError` exceptions for instances. Now if a :exc:`NameError` is raised in a method and the instance has an attribute that's exactly equal to the name in the exception, the suggestion will include ``self.<NAME>`` instead of the closest match in the method scope. (Contributed by Pablo Galindo in :gh:`99139`.)
it_it: Migliora il suggerimento di errore per le eccezioni :exc:`NameError` per le istanze. Ora, se un'eccezione :exc:`NameError` viene sollevata in un metodo e l'istanza ha un attributo esattamente uguale al nome nell'eccezione, il suggerimento includerà ``self.<NAME>`` invece della corrispondenza più vicina nell'ambito del metodo. (Contributi da Pablo Galindo in :gh:`99139`.)

source: Improve the :exc:`SyntaxError` error message when the user types ``import x from y`` instead of ``from y import x``. (Contributed by Pablo Galindo in :gh:`98931`.)
it_it: Migliora il messaggio di errore :exc:`SyntaxError` quando l'utente digita ``import x from y`` invece di ``from y import x``. (Contributi da Pablo Galindo in :gh:`98931`.)

source: :exc:`ImportError` exceptions raised from failed ``from <module> import <name>`` statements now include suggestions for the value of ``<name>`` based on the available names in ``<module>``. (Contributed by Pablo Galindo in :gh:`91058`.)
it_it: Le eccezioni :exc:`ImportError` sollevate da dichiarazioni di ``from <module> import <name>`` fallite includono ora suggerimenti per il valore di ``<name>`` basati sui nomi disponibili in ``<module>``. (Contributi da Pablo Galindo in :gh:`91058`.)

source: New Features Related to Type Hints
it_it: Nuove funzionalità relative agli hint di tipo

source: This section covers major changes affecting :pep:`type hints <484>` and the :mod:`typing` module.
it_it: Questa sezione copre le principali modifiche che riguardano :pep:`type hints <484>` e il modulo :mod:`typing`.

source: PEP 692: Using ``TypedDict`` for more precise ``**kwargs`` typing
it_it: PEP 692: Utilizzo di ``TypedDict`` per una digitazione ``**kwargs`` più precisa

source: Typing ``**kwargs`` in a function signature as introduced by :pep:`484` allowed for valid annotations only in cases where all of the ``**kwargs`` were of the same type.
it_it: La digitazione di ``**kwargs`` in una firma di funzione introdotta da :pep:`484` consentiva annotazioni valide solo nei casi in cui tutti i ``**kwargs`` erano dello stesso tipo.

source: :pep:`692` specifies a more precise way of typing ``**kwargs`` by relying on typed dictionaries::
it_it: :pep:`692` specifica un modo più preciso di digitare ``**kwargs`` affidandosi a dizionari tipizzati::

source: See :pep:`692` for more details.
it_it: Vedi :pep:`692` per ulteriori dettagli.

source: (Contributed by Franek Magiera in :gh:`103629`.)
it_it: (Contributo di Franek Magiera in :gh:`103629`.)

source: PEP 698: Override Decorator for Static Typing
it_it: PEP 698: Decoratore Override per tipizzazione statica

source: A new decorator :func:`typing.override` has been added to the :mod:`typing` module. It indicates to type checkers that the method is intended to override a method in a superclass. This allows type checkers to catch mistakes where a method that is intended to override something in a base class does not in fact do so.
it_it: Un nuovo decoratore :func:`typing.override` è stato aggiunto al modulo :mod:`typing`. Indica ai checker di tipo che il metodo è destinato a sovrascrivere un metodo in una superclasse. Questo consente ai checker di tipo di rilevare errori in cui un metodo che dovrebbe sovrascrivere qualcosa in una classe base in realtà non lo fa.

source: Example::
it_it: Esempio::

source: See :pep:`698` for more details.
it_it: Vedere :pep:`698` per maggiori dettagli.

source: (Contributed by Steven Troxler in :gh:`101561`.)
it_it: (Contributo di Steven Troxler in :gh:`101561`.)

source: Other Language Changes
it_it: Altre modifiche al Linguaggio

source: The parser now raises :exc:`SyntaxError` when parsing source code containing null bytes. (Contributed by Pablo Galindo in :gh:`96670`.)
it_it: Il parser ora solleva :exc:`SyntaxError` quando analizza il codice sorgente contenente byte nulli. (Contributo di Pablo Galindo in :gh:`96670`.)

source: A backslash-character pair that is not a valid escape sequence now generates a :exc:`SyntaxWarning`, instead of :exc:`DeprecationWarning`. For example, ``re.compile("\d+\.\d+")`` now emits a :exc:`SyntaxWarning` (``"\d"`` is an invalid escape sequence, use raw strings for regular expression: ``re.compile(r"\d+\.\d+")``). In a future Python version, :exc:`SyntaxError` will eventually be raised, instead of :exc:`SyntaxWarning`. (Contributed by Victor Stinner in :gh:`98401`.)
it_it: Una coppia carattere-barra rovesciata che non è una sequenza di escape valida ora genera un :exc:`SyntaxWarning`, invece di un :exc:`DeprecationWarning`. Ad esempio, ``re.compile("\d+\.\d+")`` ora emette un :exc:`SyntaxWarning` (``"\d"`` è una sequenza di escape non valida, utilizzare stringhe raw per le espressioni regolari: ``re.compile(r"\d+\.\d+")``). In una futura versione di Python, verrà infine sollevato un :exc:`SyntaxError`, invece di un :exc:`SyntaxWarning`. (Contributo di Victor Stinner in :gh:`98401`.)

source: Octal escapes with value larger than ``0o377`` (ex: ``"\477"``), deprecated in Python 3.11, now produce a :exc:`SyntaxWarning`, instead of :exc:`DeprecationWarning`. In a future Python version they will be eventually a :exc:`SyntaxError`. (Contributed by Victor Stinner in :gh:`98401`.)
it_it: Le sequenze di escape ottali con valore maggiore di ``0o377`` (es: ``"\477"``), deprecate in Python 3.11, ora producono un :exc:`SyntaxWarning`, invece di un :exc:`DeprecationWarning`. In una futura versione di Python, diventeranno infine un :exc:`SyntaxError`. (Contributo di Victor Stinner in :gh:`98401`.)

source: Variables used in the target part of comprehensions that are not stored to can now be used in assignment expressions (``:=``). For example, in ``[(b := 1) for a, b.prop in some_iter]``, the assignment to ``b`` is now allowed. Note that assigning to variables stored to in the target part of comprehensions (like ``a``) is still disallowed, as per :pep:`572`. (Contributed by Nikita Sobolev in :gh:`100581`.)
it_it: Le variabili utilizzate nella parte target delle comprensioni che non vengono memorizzate possono ora essere utilizzate nelle espressioni di assegnazione (``:=``). Ad esempio, in ``[(b := 1) for a, b.prop in some_iter]``, l'assegnazione a ``b`` è ora consentita. Si noti che l'assegnazione a variabili memorizzate nella parte target delle comprensioni (come ``a``) è ancora vietata, come per :pep:`572`. (Contributo di Nikita Sobolev in :gh:`100581`.)

source: Exceptions raised in a class or type's ``__set_name__`` method are no longer wrapped by a :exc:`RuntimeError`. Context information is added to the exception as a :pep:`678` note. (Contributed by Irit Katriel in :gh:`77757`.)
it_it: Le eccezioni sollevate nel metodo ``__set_name__`` di una classe o di un tipo non vengono più avvolte da un :exc:`RuntimeError`. Le informazioni di contesto vengono aggiunte all'eccezione come nota :pep:`678`. (Contributo di Irit Katriel in :gh:`77757`.)

source: When a ``try-except*`` construct handles the entire :exc:`ExceptionGroup` and raises one other exception, that exception is no longer wrapped in an :exc:`ExceptionGroup`. Also changed in version 3.11.4. (Contributed by Irit Katriel in :gh:`103590`.)
it_it: Quando una costruzione ``try-except*`` gestisce l'intero :exc:`ExceptionGroup` e solleva un'altra eccezione, quella eccezione non è più avvolta in un :exc:`ExceptionGroup`. Anche modificato nella versione 3.11.4. (Contributo di Irit Katriel in :gh:`103590`.)

source: The Garbage Collector now runs only on the eval breaker mechanism of the Python bytecode evaluation loop instead of object allocations. The GC can also run when :c:func:`PyErr_CheckSignals` is called so C extensions that need to run for a long time without executing any Python code also have a chance to execute the GC periodically. (Contributed by Pablo Galindo in :gh:`97922`.)
it_it: Il Garbage Collector ora viene eseguito solo sul meccanismo eval breaker del ciclo di valutazione del bytecode Python invece delle allocazioni di oggetti. Il GC può anche essere eseguito quando viene chiamato :c:func:`PyErr_CheckSignals` in modo che le estensioni C che devono essere eseguite per lungo tempo senza eseguire alcun codice Python abbiano anche la possibilità di eseguire periodicamente il GC. (Contributo di Pablo Galindo in :gh:`97922`.)

source: All builtin and extension callables expecting boolean parameters now accept arguments of any type instead of just :class:`bool` and :class:`int`. (Contributed by Serhiy Storchaka in :gh:`60203`.)
it_it: Tutti i callable builtin e delle estensioni che si aspettano parametri booleani ora accettano argomenti di qualsiasi tipo invece di soli :class:`bool` e :class:`int`. (Contributo di Serhiy Storchaka in :gh:`60203`.)

source: :class:`memoryview` now supports the half-float type (the "e" format code). (Contributed by Donghee Na and Antoine Pitrou in :gh:`90751`.)
it_it: :class:`memoryview` supporta ora il tipo half-float (il codice di formato "e"). (Contributo di Donghee Na e Antoine Pitrou in :gh:`90751`.)

source: :class:`slice` objects are now hashable, allowing them to be used as dict keys and set items. (Contributed by Will Bradshaw, Furkan Onder, and Raymond Hettinger in :gh:`101264`.)
it_it: Gli oggetti :class:`slice` sono ora hashabili, consentendo loro di essere utilizzati come chiavi di dizionari e elementi di insiemi. (Contributo di Will Bradshaw, Furkan Onder e Raymond Hettinger in :gh:`101264`.)

source: :func:`sum` now uses Neumaier summation to improve accuracy and commutativity when summing floats or mixed ints and floats. (Contributed by Raymond Hettinger in :gh:`100425`.)
it_it: :func:`sum` utilizza ora la sommatoria Neumaier per migliorare la precisione e la commutatività quando si sommano float o mix di int e float. (Contributo di Raymond Hettinger in :gh:`100425`.)

source: :func:`ast.parse` now raises :exc:`SyntaxError` instead of :exc:`ValueError` when parsing source code containing null bytes. (Contributed by Pablo Galindo in :gh:`96670`.)
it_it: :func:`ast.parse` solleva ora :exc:`SyntaxError` invece di :exc:`ValueError` quando analizza il codice sorgente contenente byte nulli. (Contributo di Pablo Galindo in :gh:`96670`.)

source: The extraction methods in :mod:`tarfile`, and :func:`shutil.unpack_archive`, have a new a *filter* argument that allows limiting tar features than may be surprising or dangerous, such as creating files outside the destination directory. See :ref:`tarfile extraction filters <tarfile-extraction-filter>` for details. In Python 3.14, the default will switch to ``'data'``. (Contributed by Petr Viktorin in :pep:`706`.)
it_it: I metodi di estrazione in :mod:`tarfile`, e :func:`shutil.unpack_archive`, hanno un nuovo argomento *filter* che consente di limitare le funzionalità tar che possono essere sorprendenti o pericolose, come la creazione di file al di fuori della directory di destinazione. Vedere :ref:`tarfile extraction filters <tarfile-extraction-filter>` per ulteriori dettagli. In Python 3.14, il valore predefinito passerà a ``'data'``. (Contributo di Petr Viktorin in :pep:`706`.)

source: :class:`types.MappingProxyType` instances are now hashable if the underlying mapping is hashable. (Contributed by Serhiy Storchaka in :gh:`87995`.)
it_it: Le istanze di :class:`types.MappingProxyType` sono ora hashabili se la mappa sottostante è hashabile. (Contributo di Serhiy Storchaka in :gh:`87995`.)

source: Add :ref:`support for the perf profiler <perf_profiling>` through the new environment variable :envvar:`PYTHONPERFSUPPORT` and command-line option :option:`-X perf <-X>`, as well as the new :func:`sys.activate_stack_trampoline`, :func:`sys.deactivate_stack_trampoline`, and :func:`sys.is_stack_trampoline_active` functions. (Design by Pablo Galindo. Contributed by Pablo Galindo and Christian Heimes with contributions from Gregory P. Smith [Google] and Mark Shannon in :gh:`96123`.)
it_it: Aggiungo :ref:`supporto per il profiler perf <perf_profiling>` attraverso la nuova variabile di ambiente :envvar:`PYTHONPERFSUPPORT` e l'opzione da riga di comando :option:`-X perf <-X>`, così come le nuove funzioni :func:`sys.activate_stack_trampoline`, :func:`sys.deactivate_stack_trampoline` e :func:`sys.is_stack_trampoline_active`. (Progettazione di Pablo Galindo. Contributo di Pablo Galindo e Christian Heimes con contributi di Gregory P. Smith [Google] e Mark Shannon in :gh:`96123`.)

source: New Modules
it_it: Nuovi Moduli

source: None.
it_it: Nessuno.

source: Improved Modules
it_it: Moduli Migliorati

source: The :class:`array.array` class now supports subscripting, making it a :term:`generic type`. (Contributed by Jelle Zijlstra in :gh:`98658`.)
it_it: La classe :class:`array.array` ora supporta il subscript, rendendola un :term:`generic type`. (Contributo di Jelle Zijlstra in :gh:`98658`.)

source: The performance of writing to sockets in :mod:`asyncio` has been significantly improved. ``asyncio`` now avoids unnecessary copying when writing to sockets and uses :meth:`~socket.socket.sendmsg` if the platform supports it. (Contributed by Kumar Aditya in :gh:`91166`.)
it_it: Le prestazioni della scrittura sui socket in :mod:`asyncio` sono state notevolmente migliorate. ``asyncio`` ora evita copie non necessarie durante la scrittura sui socket e utilizza :meth:`~socket.socket.sendmsg` se la piattaforma lo supporta. (Contributo di Kumar Aditya in :gh:`91166`.)

source: Add :func:`asyncio.eager_task_factory` and :func:`asyncio.create_eager_task_factory` functions to allow opting an event loop in to eager task execution, making some use-cases 2x to 5x faster. (Contributed by Jacob Bower & Itamar Oren in :gh:`102853`, :gh:`104140`, and :gh:`104138`)
it_it: Aggiungo le funzioni :func:`asyncio.eager_task_factory` e :func:`asyncio.create_eager_task_factory` per permettere a un event loop di optare per l'esecuzione rapida dei task, rendendo alcuni casi d'uso 2x a 5x più veloci. (Contributo di Jacob Bower & Itamar Oren in :gh:`102853`, :gh:`104140` e :gh:`104138`)

source: On Linux, :mod:`asyncio` uses :class:`asyncio.PidfdChildWatcher` by default if :func:`os.pidfd_open` is available and functional instead of :class:`asyncio.ThreadedChildWatcher`. (Contributed by Kumar Aditya in :gh:`98024`.)
it_it: Su Linux, :mod:`asyncio` utilizza :class:`asyncio.PidfdChildWatcher` di default se :func:`os.pidfd_open` è disponibile e funzionale invece di :class:`asyncio.ThreadedChildWatcher`. (Contributo di Kumar Aditya in :gh:`98024`.)

source: The event loop now uses the best available child watcher for each platform (:class:`asyncio.PidfdChildWatcher` if supported and :class:`asyncio.ThreadedChildWatcher` otherwise), so manually configuring a child watcher is not recommended. (Contributed by Kumar Aditya in :gh:`94597`.)
it_it: L'event loop ora utilizza il miglior watcher per figli disponibile per ogni piattaforma (:class:`asyncio.PidfdChildWatcher` se supportato e :class:`asyncio.ThreadedChildWatcher` altrimenti), quindi configurare manualmente un watcher per figli non è consigliato. (Contributo di Kumar Aditya in :gh:`94597`.)

source: Add *loop_factory* parameter to :func:`asyncio.run` to allow specifying a custom event loop factory. (Contributed by Kumar Aditya in :gh:`99388`.)
it_it: Aggiungo il parametro *loop_factory* a :func:`asyncio.run` per consentire di specificare una factory per event loop personalizzata. (Contributo di Kumar Aditya in :gh:`99388`.)

source: Add C implementation of :func:`asyncio.current_task` for 4x-6x speedup. (Contributed by Itamar Oren and Pranav Thulasiram Bhat in :gh:`100344`.)
it_it: Aggiungo l'implementazione in C di :func:`asyncio.current_task` per un miglioramento delle prestazioni da 4x a 6x. (Contributo di Itamar Oren e Pranav Thulasiram Bhat in :gh:`100344`.)

source: :func:`asyncio.iscoroutine` now returns ``False`` for generators as :mod:`asyncio` does not support legacy generator-based coroutines. (Contributed by Kumar Aditya in :gh:`102748`.)
it_it: :func:`asyncio.iscoroutine` ora restituisce ``False`` per i generatori poiché :mod:`asyncio` non supporta le coroutine basate su generatori legacy. (Contributo di Kumar Aditya in :gh:`102748`.)

source: :func:`asyncio.wait` and :func:`asyncio.as_completed` now accepts generators yielding tasks. (Contributed by Kumar Aditya in :gh:`78530`.)
it_it: :func:`asyncio.wait` e :func:`asyncio.as_completed` accettano ora generatori che generano task. (Contributo di Kumar Aditya in :gh:`78530`.)

source: Add enums :data:`calendar.Month` and :data:`calendar.Day` defining months of the year and days of the week. (Contributed by Prince Roshan in :gh:`103636`.)
it_it: Aggiungo gli enum :data:`calendar.Month` e :data:`calendar.Day` che definiscono i mesi dell'anno e i giorni della settimana. (Contributo di Prince Roshan in :gh:`103636`.)

source: Add :const:`csv.QUOTE_NOTNULL` and :const:`csv.QUOTE_STRINGS` flags to provide finer grained control of ``None`` and empty strings by :class:`csv.writer` objects.
it_it: Aggiungo le flag :const:`csv.QUOTE_NOTNULL` e :const:`csv.QUOTE_STRINGS` per fornire un controllo più fine di ``None`` e delle stringhe vuote da parte degli oggetti :class:`csv.writer`.

source: Pseudo instruction opcodes (which are used by the compiler but do not appear in executable bytecode) are now exposed in the :mod:`dis` module. :opcode:`HAVE_ARGUMENT` is still relevant to real opcodes, but it is not useful for pseudo instructions. Use the new :data:`dis.hasarg` collection instead. (Contributed by Irit Katriel in :gh:`94216`.)
it_it: Gli opcode delle pseudo-istruzioni (che sono utilizzati dal compilatore ma non compaiono nel bytecode eseguibile) sono ora esposti nel modulo :mod:`dis`. :opcode:`HAVE_ARGUMENT` è ancora rilevante per i reali opcode, ma non è utile per le pseudo-istruzioni. Usare la nuova collezione :data:`dis.hasarg` al suo posto. (Contributo di Irit Katriel in :gh:`94216`.)

source: Add the :data:`dis.hasexc` collection to signify instructions that set an exception handler. (Contributed by Irit Katriel in :gh:`94216`.)
it_it: Aggiungo la collezione :data:`dis.hasexc` per indicare le istruzioni che impostano un gestore di eccezioni. (Contributo di Irit Katriel in :gh:`94216`.)

source: Objects of type :class:`fractions.Fraction` now support float-style formatting. (Contributed by Mark Dickinson in :gh:`100161`.)
it_it: Gli oggetti di tipo :class:`fractions.Fraction` ora supportano il formato float-style. (Contributo di Mark Dickinson in :gh:`100161`.)
