Repository: python/python-docs-it
Catalog: sphinx.po
Languages: it_it

source: This Page
it_it: Questa pagina

source: Report a Bug
it_it: Riporta un Bug

source: Show Source
it_it: Visualizza codice

source: CPython implementation detail:
it_it: Dettaglio dell’implementazione di CPython:

source: Deprecated since version {deprecated}, will be removed in version {removed}
it_it: Deprecato dalla versione {deprecated}, sarà rimosso nella versione {removed}.

source: Deprecated since version {deprecated}, removed in version {removed}
it_it: Deprecato dalla versione {deprecated}, rimosso nella versione {removed}.

source: Part of the
it_it: Parte del

source: Limited API
it_it: API Limitata

source: Stable ABI
it_it: ABI Stabile

source: (as an opaque struct)
it_it: (come una struttura opaca)

source: (including all members)
it_it: (inclusi tutti i membri)

source: since version %s
it_it: dalla versione %s

source: (Only some members are part of the stable ABI.)
it_it: (Solo alcuni membri fanno parte dell'ABI stabile.)

source: This is
it_it: Questa pagina

source: Unstable API
it_it: API Instabile

source: . It may change without warning in minor releases.
it_it: . Potrebbe cambiare senza preavviso nelle release minori.

source: Return value: Always NULL.
it_it: Valore di ritorno: Sempre NULL.

source: Return value: New reference.
it_it: Valore di ritorno: Nuovo riferimento.

source: Return value: Borrowed reference.
it_it: Valore di ritorno: Riferimento preso in prestito.

source: in development
it_it: in sviluppo

source: stable
it_it: stabile

source: security-fixes
it_it: correzioni di sicurezza

source: Welcome! This is the official documentation for Python %(release)s.
it_it: Benvenuti! Questa è la documentazione di Python %(release)s.

source: Documentation sections:
it_it: Sezioni della documentazione:

source: What's new in Python %(version)s?
it_it: Cosa c'è di nuovo in Python %(version)s?

source: Or <a href="%(whatsnew_index)s">all "What's new" documents since Python 2.0</a>
it_it: o <a href="%(whatsnew_index)s">tutti i documenti "Cosa c'è di nuovo"</a> dalla versione 2.0 di Python

source: Start here: a tour of Python's syntax and features
it_it: Inizia da qui: un tour della sintassi e delle funzionalità di Python

source: Library reference
it_it: Riferimenti alla libreria

source: Standard library and builtins
it_it: Libreria standard e funzioni integrate

source: Language reference
it_it: Guida al Linguaggio

source: Syntax and language elements
it_it: Sintassi ed elementi del linguaggio

source: Python setup and usage
it_it: Installazione e utilizzo di Python

source: How to install, configure, and use Python
it_it: Come installare, configurare e utilizzare Python

source: Python HOWTOs
it_it: HOWTO Python

source: In-depth topic manuals
it_it: Manuali di argomenti approfonditi

source: Installing Python modules
it_it: Installazione dei moduli Python

source: Third-party modules and PyPI.org
it_it: PyPI.org e moduli di terze parti

source: Distributing Python modules
it_it: Distribuzione dei moduli Python

source: Publishing modules for use by other people
it_it: Pubblicazione di moduli per l'uso da parte di altre persone

source: Extending and embedding
it_it: Estendere ed integrare

source: For C/C++ programmers
it_it: Tutorial per programmatori C/C++

source: Python's C API
it_it: L'API C di Python

source: C API reference
it_it: Riferimento all'API C

source: FAQs
it_it: Le FAQ

source: Frequently asked questions (with answers!)
it_it: Domande frequenti (con risposte!)

source: Indices, glossary, and search:
it_it: Indici, glossario e ricerca:

source: Global module index
it_it: Indice globale dei moduli

source: All modules and libraries
it_it: Tutti i moduli e le librerie

source: General index
it_it: Indice generale

source: All functions, classes, and terms
it_it: Tutte le funzioni, le classi, i termini

source: Glossary
it_it: Glossario

source: Terms explained
it_it: Spiegazione dei termini

source: Search page
it_it: Pagina di Ricerca

source: Search this documentation
it_it: Cerca in questa documentazione

source: Complete table of contents
it_it: Tabella dei contenuti completa

source: Lists all sections and subsections
it_it: Elenca tutte le sezioni e sottosezioni

source: Project information:
it_it: Informazioni sul progetto:

source: Reporting issues
it_it: Segnalazione di problemi

source: Contributing to Docs
it_it: Contribuire alla documentazione

source: Download the documentation
it_it: Scarica questa documentazione

source: History and license of Python
it_it: Storia e licenza di Python

source: About the documentation
it_it: Informazioni sulla documentazione

source: Download these documents
it_it: Scarica questi documenti

source: Docs by version
it_it: Documenti per versione

source: Stable
it_it: Stabile

source: In development
it_it: In sviluppo

source: All versions
it_it: Tutte le versioni

source: Other resources
it_it: Altre risorse

source: PEP Index
it_it: Indice PEP

source: Beginner's Guide
it_it: Guida per principianti

source: Book List
it_it: Elenco di Libri

source: Audio/Visual Talks
it_it: Interventi audio/video

source: Python Developer’s Guide
it_it: Guida per sviluppatori Python

source: This document is for an old version of Python that is no longer supported. You should upgrade, and read the
it_it: Questo documento è per una vecchia versione di Python che non è più supportata. Dovresti aggiornare e leggere

source: Python documentation for the current stable release
it_it: Documentazione di Python per l'attuale versione stabile

source: This is a deploy preview created from a <a href="%(repository_url)s/pull/%(pr_id)s">pull request</a>. For authoritative documentation, see
it_it: Questa è una anteprima di distribuzione creata da una <a href="%(repository_url)s/pull/%(pr_id)s">richiesta di pull</a>. Per una la documentazione autorevole, vedi

source: the current stable release
it_it: l'attuale versione stabile
